import React from 'react';

const AT286 = () => {
  return (
    <div>
      <h1>AT286</h1>
      <h2 id="">1. Основни характеристики</h2>
      <p>
        Процесорът Intel 80286 (обикновено се съкращава като 286) е представен
        за пръв път през 1981 година. Той представлява второто поколение
        процесори за РС. С тези чипове информацията вече се придвижва по 16, а
        не по 8 бита наведнъж, осигурявайки огромен скок в бързодействието на
        системите и ефективността на обработка на данните. <nl/> <br /> IBM избират
        този процесор като основа на компютърната система IBM AT, защото
        осигурява софтуерна съвместимост с 8088, който пък е използван в РС и ХТ
        системите. Това означава, че написаният преди това софтуер за 8088 може
        да работи и на новия 286. <br /> Процесорът 286 е неколкократно по-бърз
        от 8088 и предлага значително увеличаване на производителността на
        РС-тата, използвани в бизнеса. Причините за увеличеното бързодействие са
        следните:
      </p>
    </div>
  );
};

export default AT286;
