export const kmLectures = [
  {
    id: 'cables',
    razdel: 'Хардуер',
    title: 'Мрежова преносна среда',
    url: '/km/cables',
    description:
      'придобиване на знания за физически компоненти – кабели, конектори',
    text: 'Мрежовата преносна среда осигурява предаване на сигналите между компютрите и останалите устройства включени в компютърната мрежа.',
  },
  {
    id: 'connectDevices',
    razdel: 'Хардуер',
    title: 'Мрежови устройства за свързване',
    url: '/km/devices',
    description:
      'придобиване на знания за физически компоненти - мрежови карти, модеми',
    text: 'При изграждането на компютърните мрежи се налага да използваме и допълнителни устройства за свързване – хъбове, концентратори, маршрутизатори, модеми и т.н.',
  },
  {
    id: 'lan',
    razdel: 'Категоризация',
    title: 'според физическия обхват',
    url: '/km/lan',
    description:
      'придобиване на знания за категориите мрежи според физически обхват',
    text: 'Физическият обхват включва географската област, която се заема от мрежата.',
  },
  {
    id: 'admin',
    razdel: 'Категоризация',
    title: 'според метода на администриране',
    url: '/km/admin',
    description:
      'придобиване на знания за категориите мрежи според метод на администриране',
    text: 'От гледна точка на администрирането, една мрежа може да бъде организирана по един от следните два начина: P2P, Client-server',
  },
  {
    id: 'topology',
    razdel: 'Категоризация',
    title: 'според топологията',
    url: '/km/topology',
    description:
      'придобиване на знания за категориите мрежи според топологията',
    text: 'Терминът „топология” се отнася до физическото разположение на компютрите, кабелите и другите компоненти на мрежата',
  },
  {
    id: 'protocols',
    razdel: 'Категоризация',
    title: 'според протоколите',
    url: '/km/cat_protocols',
    description:
      'придобиване на знания за категориите мрежи според протоколите',
    text: 'Мрежовите протоколи са средството, чрез което компютрите комуникират помежду си. Те са съвкупност от правила, чието изпълнение позволява мрежови компоненти изградени от различни производители да работят съвместно.',
  },
  {
    id: 'architecture',
    razdel: 'Категоризация',
    title: 'според архитектурата',
    url: '/km/architecture',
    description:
      'придобиване на знания за категориите мрежи според архитектурата',
    text: 'Мрежовата архитектура включва набор от спецификации – вида на топологията, типа на кабела, методите за достъп до преносната среда, размера на пакетите и други фактори.',
  },
  {
    id: 'packets',
    razdel: 'Модели',
    title: 'Концепции на компютърните комуникации',
    url: '/km/packets',
    description: '',
    text: 'Как компютрите комуникират помежду си? Комуникацията в действителност е сложен процес. Ще разгледаме как компютрите обработват информацията.',
  },
  {
    id: 'models',
    razdel: 'Модели',
    title: 'Мрежови модели',
    url: '/km/models',
    description: 'придобиване на знания за моделите OSI, DoD и др',
    text: 'Целта на мрежовите модели е да ни помогнат при изучаването и разбирането на мрежовите комуникации. Мрежовите модели са в основата на стандартизацията на мрежовото оборудване.',
  },
  {
    id: 'network_protocols',
    razdel: 'Протоколи',
    title: 'Мрежови протоколи',
    url: '/km/protocols',
    description: '',
    text: 'Мрежовият протокол е съвкупност от правила, чрез които компютрите и останалите устройства в мрежата комуникират помежду си.',
  },
  {
    id: 'ip_protocol',
    razdel: 'Протоколи',
    title: 'Протоколът IP',
    url: '/km/ip',
    description:
      'придобиване на знания за TCP/IP помощни програми – ping, arp, netstat, ipconfig, tracert',
    text: 'ТCP/IP е основният мрежов протокол, който се използва в глобалната мрежа Интернет.',
  },
  {
    id: 'tcp_udp',
    razdel: 'Протоколи',
    title: 'Протоколи TCP и UDP',
    url: '/km/udp',
    description: 'придобиване на знания за TCP/UDP',
    text: 'Двата протокола TCP (Transmission Control Protocol) и UDP (User Datagram Protocol) работят в транспортния слой на модела DoD.',
  },
  {
    id: 'helpers',
    razdel: 'Протоколи',
    title: 'TCP/IP помощни програми',
    url: '/km/iphelpers',
    description:
      'придобиване на знания за TCP/IP помощни програми – ping, arp, netstat, ipconfig, tracert',
    text: 'В операционната система Windows са включени няколко помощни програми за разглеждане на конфигурационната информация и отстраняване на проблеми. ',
  },
  {
    id: 'threats',
    razdel: 'Защита',
    title: 'Заплахи за мрежовата сигурност',
    url: '/km/threats',
    description: 'начините за защита и възстановяване от сривове',
    text: 'Днес, когато почти всяка локална мрежа има достъп до Интернет, външните заплахи са основен проблем за мрежовата сигурност.',
  },
  {
    //here
    id: 'protect',
    razdel: 'Защита',
    title: 'Защита и възстановяване от сривове',
    url: '/km/protecthard',
    description: 'начините за защита и възстановяване от сривове',
    text: 'При планиране на мрежовата сигурност трябва да се има предвид и възможността за загуба на информация поради природни бедствия, хардуерни повреди и технически грешки.',
  },
];
