import React from 'react';

function Admin() {
  return (
    <div>
      <h1>Категоризиране на мрежите според метода на администриране</h1>
      <ul style={{ listStyle: 'inside' }}>
        От гледна точка на администрирането, една мрежа може да бъде
        организирана по един от следните два начина:
        <li> Като равноправна мрежа (peer-to-peer network)</li>
        <li>Като мрежа клиент-сървър (server based network)</li>
        <h3>
          <b>Сървъри и клиенти</b>
        </h3>
        <li>
          Сървърът представлява компютър, който предоставя (споделя) своите
          ресурси на останалите компютри в мрежата (данни, софтуер, принтери и
          др.). Клиентът е компютър, който осъществява достъп до ресурсите на
          сървъра. Тъй като всеки един от компютрите в мрежата може да споделя
          своите ресурси и на останалите компютри, то може да се каже, че всеки
          компютър работи и като клиент и като сървър. Затова ще приемем, че
          сървърът е компютър, който е по-мощен от останалите и изпълнява строго
          определени функции. Този компютър се използва основно за
          централизирано управление на мрежовите услуги.
        </li>
        <h3>
          <b>Специализирани сървъри</b> <br />
        </h3>
        Сървърите могат да бъдат специализирани в извършването на отделни
        дейности и услуги. В съвременните компютърни мрежи може да има:
        <li>
          файлови сървъри (file servers) – съхраняват файлове с данни на
          потребителите в мрежата
        </li>
        <li>
          принт сървъри (print servers) – управляват печатането на един или
          няколко принтера, към които потребителите изпращат заявки за печат.
          Често принт сървърите представляват обособени устройства или са част
          от мрежовия принтер
        </li>
        <li>
          приложни сървъри (application servers) – на тези компютри е
          инсталирана сървърската част на Клиент-Сървър мрежови приложения.
        </li>
        <li>
          терминални сървъри (terminal servers) – потребителите работят чрез
          програма – терминален емулатор. Те стартират и използват програми,
          които са инсталирани и се изпълняват на компютъра – сървър;
        </li>
        <li>
          сървъри за база данни (data base servers) – позволяват на
          потребителите достъп до общи бази данни и се грижат за поддържането на
          тези бази данни;
        </li>
        <li>web сървъри – предоставят достъп до web страници;</li>
        <li>
          мейл сървъри (mail servers) – предоставят услугата електронна поща.
          Текущата електронна кореспонденция на потребителите се съхранява на
          тези сървъри;
        </li>
        <li>
          прокси сървъри (proxy servers) – действат като посредници между
          потребителите и Интернет като осигуряват сигурност и възможност за
          административен контрол на потока от информация;
        </li>
        <li>
          DHCP сървъри – назначават автоматично IP адреси на компютрите в
          мрежата и всички необходими настройки за работа на компютъра в
          мрежата;
        </li>
        <li>
          DNS сървъри – позволяват асоцииране на мрежови имена на компютри с
          техните IP адреси, като по този начин се премахва необходимостта от
          запомняне на IP адреси при разглеждане на web страници.
        </li>
      </ul>
      <p>
        <h3>
          <b>Клиент</b>
        </h3>
        - Клиентът е мрежово устройство, което изпраща заявка за ползване на
        даден ресурс в мрежата. Клиентът обикновено, но не винаги е компютър.
        Той може да бъде и друго устройство като например индустриална везна,
        компютър бележник, мобилен телефон и др. Клиент може да бъде и софтуерна
        програма. Ако при своето изпълнение тя се свързва с друг компютър –
        сървър, то тогава говорим за клиентска програма. Например програмата за
        електронна поща се свързва с мейл- сървъра за да получи или изпрати
        писмата на потребителя.
        <br />
        <h3>
          <b>Работна станция </b>{' '}
        </h3>
        - Работните станции са еднопотребителски, високопроизводителни
        микрокомпютри (или миникомпютри), които са специализирани обикновено за
        разработване на графичен дизайн. Също като персоналните компютри имат
        клавиатура и мишка, но притежават и специализирани устройства за
        сканиране и цифровизиране на двумерна и тримерна графична информация.{' '}
        <br />
        Често терминът „работна станция” се използва за „компютър – клиент в
        локалната мрежа”.
        <br />
        <h3>
          <b>Хост</b>
        </h3>
        - С този термин на практика може да се обозначава всяко мрежово
        устройство, което има IP адрес. Хостването е предоставяне на услуга на
        друго устройство. Например Web сървърът хоства web страниците на
        потребителите.
      </p>
      <h2>Равноправна мрежа</h2>
      <p>
        При тези мрежи всички компютри са равнопоставени. Всеки компютър работи
        и като клиент и като сървър. Няма администратор за цялата мрежа.
        Потребителите сами администрират собствения си компютър. Обикновено при
        равноправната мрежа компютрите не са повече от 10.
      </p>
      <center>
        <img
          src="https://pomagalo1.com/ufiles/2010-05-10/760/kompiutyrni-mreji_html_m500ba961.png"
          style={{ width: '32rem' }}
        ></img>
      </center>
      <p>
        Равноправната мрежа е сравнително проста. Тя няма нужда от мощен
        централен сървър и допълнителни компоненти, затова е сравнително евтина.
        При равноправната мрежа не е необходимо мрежовияt софтуер да има висока
        производителност и ниво на защита.
      </p>
      <ul style={{ listStyle: 'inside' }}>
        <h3>При изграждане на равноправна мрежа:</h3>
        <li>
          Потребителите са администратори на своите компютри и планират
          собствената си система за сигурност
        </li>
        <li>
          Използва се проста и лесна кабелна схема за свързване на компютрите.
        </li>
        <h3>Равноправни мрежи са подходящи когато:</h3>
        <li>Потребителите се намират на едно и също място</li>
        <li>Защитата не е задължителна;</li>
        <li>Фирмата и мрежата няма да се разрастват много в близко бъдеще.</li>
      </ul>
      <h3>В равноправна среда всеки компютър трябва да:</h3>
      <li>
        Използва голям процент от своите ресурси за поддръжка на локалния
        потребител;
      </li>
      <li>
        Използва допълнителни ресурси за обслужване на останалите потребители от
        мрежата
      </li>
      <p>
        Системата за сигурност се състои в задаване на парола за всеки ресурс
        (поделена директория или устройство). Тъй като всички потребители на
        равноправната мрежа сами настройват своята система за сигурност,
        централизираният контрол е много труден. Това оказва влияние върху
        сигурността на мрежата. <br />
        При равноправната мрежа всеки компютър работи и като клиент и като
        сървър, затова потребителите трябва да бъдат квалифицирани, за да могат
        да работят и като администратори и като обикновени потребители.
      </p>
      <h2>Мрежа клиент-сървър</h2>
      <p>
        В този тип мрежа има един главен компютър, наричан сървър, който
        обслужва мрежата. Той съхранява информация и ресурси и ги прави достъпни
        за останалите компютри в мрежата. Останалите компютри, включени в
        мрежата, са клиенти. Инсталирането на сървър позволява да се премине към
        централизирано управление на всички компютри в мрежата. Той позволява на
        останалите потребители да влизат в мрежата чрез уникално име на
        потребител и парола.
      </p>
      <center>
        <img
          style={{ width: '32rem' }}
          src="https://upload.wikimedia.org/wikipedia/commons/thumb/c/c9/Client-server-model.svg/1200px-Client-server-model.svg.png"
        ></img>
      </center>
      <p>
        Клиент-сървър мрежата е по-добрият вариант, когато компютрите са повече
        от десет. Администрирането на клиент-сървър мрежите е по-опростено
        особено за мрежи с голям брой компютри и споделени ресурси. Споделените
        файлове се съхраняват на сървъра, така че да могат лесно да бъдат
        архивирани и намирани. Управлението на този вид мрежи се осъществява от
        системен администратор – специално обучен човек, който упражнява контрол
        върху всички мрежови операции и ресурси.
        <br />
        Сигурността на системата е значително по-добра от тази при равноправните
        мрежи. За да влезе в мрежата всеки потребител трябва да има
        потребителско име и парола, създадени на сървъра. Мрежовият
        администратор може да даде различни права за достъп до даден ресурс на
        различните потребители. На един от потребителите може да се даде право
        само за четене на даден файл без възможност за промени в него. Друг
        потребител може да има права и за четене и за запис на същия файл.
        По-добрият вариант е отделните потребители да се обединят в групи и да
        се назначат права за отделните групи от потребители.
        <br />
        Архивирането на данните, намиращи се в сървъра се осъществява и
        контролира по-лесно. За по-висока надеждност на данните съхранявани на
        сървъра, те трябва да се дублират.
        <br />
        Мрежите със сървъри могат да имат хиляди потребители. Те са по-скъпи от
        мрежите с равноправен достъп, но са най-доброто решение за големи
        компании или когато има нужда от съхраняване на голям обем информация.
      </p>
      <ul style={{ listStyle: 'inside' }}>
        <h3>Клиент-сървър мрежите са подходящи когато:</h3>
        <li>Потребителите са повече от 10;</li>
        <li>Потребителите са в различни стаи, етажи или дори сгради;</li>
        <li>Сигурността и защитата на информацията са от особено значение;</li>
        <li>Фирмата и мрежата може да се разрастват в близко бъдеще.</li>
      </ul>
    </div>
  );
}

export default Admin;
