import React from 'react';

function ByArch() {
  return (
    <div>
      <h1>Категоризиране на мрежите според архитектурата</h1>
      <p>
        Компютърните мрежи могат да бъдат класифицирани и според използваната
        архитектура. Мрежовата архитектура включва набор от спецификации – вида
        на топологията, типа на кабела, методите за достъп до преносната среда,
        размера на пакетите и други фактори. В момента най-популярната
        архитектура е Ethernet, която съществува в няколко разновидности.
        Съществуват и други архитектури като Token Ring, Apple Talk, ARCnet, но
        тяхното използване е доста ограничено.
      </p>
      <h2>Ethernet мрежи</h2>
      <p>
        Ethernet мрежите са създадени през 60-те години от фирмата Xerox, след
        което търпят развитие. Ethernet е технология за локални мрежи, която
        свързва устройства, които са сравнително близо едно до друго. Повечето
        съвременни локални мрежи не позволяват линии по-дълги от няколко стотин
        метра, въпреки че с подходящ оптичен кабел може да се постигнат
        значителни разстояния.
        <br />
        Ethernet устройствата се свързват към обща преносна среда, която
        позволява на устройствата да обменят данни помежду си. В началото тази
        среда е била меден коаксиален кабел, а в днешно време се използват
        основно UTP или оптични кабели. Топологията при Ethernet мрежите може да
        бъде шина или звезда, а методът за достъп до преносната среда се нарича
        CSMA/CD. <br />
        Съкращението CSMA/CD идва от carrier-sense multiple access with
        collision detection (множествен достъп с откриване на носещата и
        разпознаване на конфликтите) и показва как се осъществява комуникацията
        между станциите. <br />
        Терминът multiple access означава, че когато някоя от станциите „говори”
        всички останали са в състояние да я „слушат”. Преди обаче някоя станция
        да започне да предава, тя прослушва средата, за да провери дали някоя
        друга вече не го прави. Ако средата е “тиха”, тогава може да започне да
        “говори”. Това е именно carrier sense. <br />
        Carrier-sense multiple access (CSMA) е добра организация за комуникация
        между компютрите. Какво ще се случи обаче ако две станции започнат
        едновременно да „говорят”? Тогава настъпва колизия. Методът collision
        detection (CD) предполага при възникване на колизия и двете станции да
        спрат да предават. Изчаква се произволен интервал от време и след това
        отново се прави опит за предаване на информация.
      </p>
      <ol style={{ listStyle: 'inside' }}>
        <h3>
          В зависимост от типа на използвания кабел Ethernet мрежите се разделят
          на следните категории:
        </h3>
        <li>10Base5</li>
        <ul>
          Този стандарт е най-старият между всички останали, и в днешно време
          почти не се използва.
          <li> 10 – скорост на локалната мрежа в Mbps. </li>
          <li>
            Base = Baseband 5 – дължина на мрежовият сегмент в стотици метри
          </li>
          <li>
            10Base5 мрежите използват дебел коаксиален кабел (RG-8 или RG-11) и
            шинна топология на свързване. Поради ниските скорости и по-трудното
            свързване на кабелите този стандарт почти не се използва.
          </li>
        </ul>
        <li>10Base2</li>
        <ul>
          <li>Скорост на предаване на данни -10 Mbps</li>
          <li>Основна използвана топология – обща шина</li>
          <li>
            Кабел – коаксиален, тънък (6мм), тип RG-58 със съпротивление 50 ома
          </li>
          <li>Максимална дължина на сегмента – 185 метра</li>
          <li>Метод на предаване на сигнала – Baseband</li>
        </ul>
        <li>10BaseT</li>
        <ul>
          <li>Скорост на предаване на данни – 10 Mbps</li>
          <li>Кабел – UTP, Cat 3</li>
          <li>Метод на предаване на сигнала – Baseband</li>
        </ul>
        <li>100BaseT</li>
        <ul>
          <li>Скорост на предаване на данни – 100 Mbps</li>
          <li>Кабел – UTP, Cat 5 или Cat 5е</li>
          <li>Метод на предаване на сигнала – Baseband</li>
        </ul>
        <li>1000BaseT</li>
        <ul>
          <li>Скорост на предаване на данни – 1000 Mbps</li>
          <li> Кабел – UTP, Cat 6</li>
          <li>Метод на предаване на сигнала – Baseband</li>
        </ul>
        Мрежите 10BaseT, 100BaseT, 1000BaseT използват кабели с усукани двойки
        проводници (T – twisted – усукан). UTP кабелите се произвеждат в
        различни категории от Cat 1 до Cat 6. Всяка отделна категория има и
        максимално допустима скорост на предаване.
        <li>1000BaseVG-AnyLAN</li>
        <ul>
          <li>
            Мрежовата архитектура 1000BaseVG-AnyLAN е разработена от фирмата
            Hewlett Packard като бърза, достъпна архитектура, използваща хъб
            като интелигентно свързващо устройство. Макар, че се класифицират
            към Ethernet мрежите, при тях методът на достъп до преносната среда
            е различен – нарича се приоритет на поискване (demand priority).
          </li>
        </ul>
        <li>10BaseFL</li>
        <li>100BaseFL</li>
      </ol>
      <h2>Token Ring мрежи</h2>
      <p>
        Архитектурата Token Ring е реализирана от фирмата IBM през 1984 г. за
        свързване на компютри на фирмата и друго оборудване в локална мрежа.
        Днес тази архитектура почти не се използва. Топологията при Token Ring е
        логически „кръг”. <br />
        Основното, което отличава архитектурата Token Ring от останалите видове
        е методът на достъп до преносната среда – в мрежата се генерира
        управляващ маркер (token), който обикаля в кръг (ring). Така маркерът
        преминава през всички компютри, докато някой от тях сигнализира, че иска
        да изпрати данни и поеме контрола върху маркера. Маркерът представлява
        съвкупност от няколко бита, със специално предназначение. Само
        компютърът, който притежава маркера може да предава информация.
        <br />
        След като един компютър получи маркера, той може да изпрати кадър от
        данни. Кадърът преминава по кръга, докато достигне до компютъра –
        получател на данните. При пристигане на данните в компютъра – получател,
        съответно той копира информацията от кадъра и поставя маркировка в
        полето за „състоянието на кабела”, че данните са получени.
        <br />
        Кадърът продължава по кръга докато достигне до компютъра, който изпраща
        информацията. По маркировката в кадъра той разбира, че информацията е
        получена успешно. Кадърът се премахва от кръга и компютърът създава нов
        маркер, който продължава да се движи по кръга. Маркерът може да пътува
        само в една посока. Само, когато в мрежата има свободен маркер, един от
        компютрите може да го използва за изпращане на данни.
        <br />
        Маркерът се генерира от първия компютър, който се включва в системата.
        Този компютър се назначава за наблюдател на системата и следи за
        получаването на данните в мрежата. Той също така проверява кадрите от
        данни, които се движат в кръга повече от два пъти и се грижи за това да
        няма повече от един маркер в мрежата. <br />
        При включване на нов компютър в работеща Token Ring, мрежата го
        инициализира, за да може той да стане част от кръга. Това включва
        проверка за дублиращи адреси и изпращане на съобщения до другите
        компютри за „влизането” в кръга на нов компютър.
      </p>
      <center>
        <img
          style={{ width: '32rem' }}
          src="https://upload.wikimedia.org/wikipedia/commons/thumb/c/cb/Token_ring.svg/600px-Token_ring.svg.png"
        ></img>
      </center>
    </div>
  );
}

export default ByArch;
