import React from 'react';

function ByProtocols() {
  return (
    <div>
      <h1>Категоризиране на мрежите според протоколите</h1>
      <p>
        Мрежите могат да се класифицират и на базата на протоколите, които
        използват за комуникация. Мрежовите протоколи са средството, чрез което
        компютрите комуникират помежду си. Те са съвкупност от правила, чието
        изпълнение позволява мрежови компоненти изградени от различни
        производители да работят съвместно. Най-често използваните протоколи в
        локалните мрежи са IPX/SPX, NetBEUI и TCP/IP. Тези протоколи по-детайлно
        се разглеждат в Раздел 4. Мрежови протоколи и услуги.
      </p>
      <h2>IPX/SPX мрежи</h2>
      <p>
        Фирмата Novell изгражда своите продукти на базата на Ethernet
        спецификацията IEEE 802.3 чрез протоколите Internet Package
        Exchange/Sequence Packet Exchange. Използването им е задължително до
        версия 4 на операционната система NetWare. Пълна поддръжка на TCP/IP за
        файлов и принт сървър се поддържат след NetWare 5.0. NetWare версия 4
        поддържа TCP/IP за целите на вградения web сървър. <br />
        Поради голямата популярност и надеждност на продуктите NetWare,
        Microsoft включва в операционните системи Windows, IPX/SPX съвместимия
        протокол NWLink. Всеки компютър с операционна система Windows може да
        бъде както клиент, така и сървър на NetWare мрежа, чрез използване на
        IPX/SPX или NWLink протоколите. <br />
        IPX/SPX мрежата изисква минимално конфигуриране (всяка мрежова
        интерфейсна карта има зададен MAC адрес) и предлага по-висока мрежова
        производителност в сравнение с TCP/IP мрежите. IPX/SPX протоколите се
        използват за връзка към NetWare сървъри. От съображения за сигурност
        много потребители използват IPX/SPX протоколите за споделяне на файлове
        и принтери в локални мрежи. Съответно интернет потребителите използват
        TCP/IP протокола и не могат да достигнат до локалните сървъри,
        използващи IPX/SPX.
      </p>
      <h2>NetBEUI мрежи</h2>
      <p>
        За споделяне на файлове и принтери (File and printer sharing) в
        операционните системи Windows, Microsoft предлага протокола NetBEUI
        (NetBIOS Extended User Interface). Това е прост, бърз протокол,
        позволяващ висока мрежова производителност на използващите го системи.
        NetBEUI се използва само в локални мрежи, той не поддържа
        маршрутизиране. Единственото конфигуриране, което се изисква е задаване
        на уникално име на всеки компютър в локалната мрежа. За по-лесно
        търсене, компютрите се обединяват в работни групи.
      </p>
      <h2>TCP/IP мрежи</h2>
      <p>
        TCP/IP е протоколът, който използва глобалната мрежа Интернет. На
        практика всички хардуерни платформи и операционни системи поддържат
        TCP/IP. Той е най-бавен и труден за конфигуриране от популярните LAN
        протоколи, но това се компенсира с неговата сигурност, възможност за
        маршрутизиране и голямото количество клиентски и сървърски програмни
        продукти, които го поддържат. За споделяне на файлове и принтери в
        TCP/IP мрежите се използва протокола ‘NetBIOS Over TCP/IP’.
      </p>
    </div>
  );
}

export default ByProtocols;
