import React from 'react';

const Cables = () => {
  return (
    <div>
      <h1>Мрежова преносна среда</h1>
      <p>
        Мрежовата преносна среда осигурява предаване на сигналите между
        компютрите и останалите устройства включени в компютърната мрежа.
        Основният начин за връзка е с помощта на кабел. Съществуват и други
        технологии за пренос на информация – безжични връзки. В настоящата тема
        са разгледани двата вида преносни среди – кабелна и безжична.
      </p>
      <h2>Мрежово окабеляване</h2>
      <p>
        При изграждане на компютърна мрежа основният начин за връзка между
        компютрите е с помощта на кабел. Кабелът се явява основен компонент,
        чийто избор определя какви допълнителни компоненти ще са необходими за
        съответната мрежа. Най-често се използват следните основни видове
        кабели: · Коаксиални; · С усукани двойки проводници; · Оптически.
      </p>
      <h2>Коаксиален кабел</h2>
      <p>
        Коаксиалният кабел е бил индустриален стандарт и все още се среща в
        по-старите мрежи. Този кабел е подобен на използвания от кабелната
        телевизия. Той има дебел меден проводник в центъра, който е обвит от
        изолиращ пластмасов слой. Сигналът се предава по медния проводник.
        Изолиращият слой е обвит с метално фолио или оплетка от мед или
        алуминий. Този външен проводник е разположен по цялата дължина на
        кабела, откъдето идва и името коаксиален (coaxial): – съвместно (co) и
        по цялата ос на кабела (axial) има два физически канала – медният
        проводник (сърцевината) за пренос на сигналите и оплетката – за земя.
        Външният слой играе и ролята на екран срещу външни смущения. Всички тези
        компоненти се опаковат с обвивка от пластмаса, гума или негорим
        материал. Коаксиалният кабел е стандартизиран чрез спецификациите RG
        (Registered Grade). Използван в компютърните мрежи той има основно две
        разновидности – тънък (thinnet) и дебел (thicknet).
      </p>
      <center>
        <img src="http://pgds.org/books/km/01_files/image002.gif" alt=""></img>
      </center>
      <h2>Тънък коаксиален кабел</h2>
      <p>
        Тънкият коаксиален кабел е с диаметър една четвърт инч и е по-гъвкав от
        thicknet кабела. Спецификацията, която най-много се използва е RG-58.
        Неговият импеданс е 50 ома. Сигналът при този вид кабел може да се
        пренася на разстояния до 185 метра, след което започва да заглъхва.
        <br />
        <b>*Забележка*</b> <br />
        Коаксиалният кабел, използван от кабелната телевизия прилича на thinnet
        кабела, но не е същият. При кабелната телевизия се използва кабел със
        спецификация RG-59, RG-6, RG-11 с импеданс 75 ома. Коаксиалният кабел не
        е скъп, но е труден за употреба. Чрез него се постигат по-ниски скорости
        на трансфер в сравнение с кабелите с усукани двойки проводници. Използва
        се на ограничени места в индустрията, при наличие на силни
        електромагнитни полета.
      </p>
      <h2>Хардуер за свързване на тънък коаксиален кабел</h2>
      <p>
        За свързване на тънкия коаксиален кабел в мрежа се използва компонент,
        наречен British Naval Connector (BNC) конектор.
      </p>
      <center>
        <img
          style={{ width: '20rem' }}
          src="https://media.cablematic.com/__sized__/images_1000/ay08700-01-thumbnail-540x540-70.jpg"
          alt=""
        ></img>
      </center>
      <ul style={{ listStyleType: 'circle' }}>
        <b>Съществуват следните видове конектори:</b>
        <li>- BNC кабелен конектор;</li>
        <li>- BNC Т конектор (1 мъжки + 2 женски (1M+2F), 3 женски (3F));</li>
        <li>- BNC цилиндричен конектор (F-F);</li>
        <li>- BNC терминатор.</li>
      </ul>
      <center>
        <img
          src="https://4.imimg.com/data4/NE/QQ/MY-28353445/china_many_types_of_connectors_bnc20131221753557-500x500.jpg"
          alt=""
        ></img>
      </center>
      <p>
        Към двата края на коаксиалния кабел се монтират BNC кабелни конектори.
        Връзката между два кабела и мрежовата карта се осъществява с помощта на
        BNC T конектор. В двата края на мрежата, към свободния край на T
        конектора е необходимо да се постави по един BNC терминатор – 50 омово
        съпротивление. Чрез това съпротивление се избягва ефекта на „отразения
        сигнал”.
      </p>
      <h2>Кабел с усукани двойки проводници</h2>
      <p>
        Кабелът с усукани двойки представлява една или повече двойки от медни
        проводници, усукани една около друга и обвити с външна изолация. Чрез
        усукването на проводниците се предотвратява влиянието на
        електромагнитните смущения върху предавания сигнал.
        <br />
        <b>*Забележка*</b> <br />
        По всяка двойка проводници тече ток по затворен контур. Сигналът в една
        от двойките проводници създава магнитно поле, което генерира
        електродвижещо напрежение в съседните проводници. Напрежението, което се
        генерира във всеки един от двойка проводници е еднакво по големина. Но
        тъй като тока тече в контур, то се явява противоположно по посока.
        Влиянието на шума се неутрализира. <br />
      </p>
      Има няколко типа кабели с усукани двойки:
      <center>
        <ul>
          <li>
            <b>- Неекранирана усукана двойка (Unshielded Twisted Pair – UTP)</b>
            <br />
            Това е най-евтиният кабел, който се използва масово в съвременните
            компютърни мрежи. UTP е направен от една или повече двойки от медни
            проводници, като всеки проводник в двойката е усукан около другия.
            UTP обикновено се състои от 4 двойки от усукани кабели с цветови
            кодове. Основен недостатък на UTP е, че не е удобен за предаване на
            данни на дълги разстояния – до 90 метра. С увеличаването на
            дължината на кабела се влошава качеството и силата на сигнала.
            Съществува вариант на UTP кабела – patch кабел – при който
            проводниците са многожилни.
          </li>
          <img
            style={{ width: '20%' }}
            src="http://steinberger.bg/userfiles/productlargeimages/product_5299.jpg"
          ></img>
          <li>
            <b>- Екранирана усукана двойка (Shielded Twisted Pair – STP)</b>
            <br />
            Този кабел е подобен на UTP, с няколко цветово кодирани усукани
            двойки, но той включва и защитно фолио под пластмасовата изолация.
            Всяка двойка е екранирана. Защитното покритие предпазва проводниците
            от външни смущения и помага за защитата на данните. Това оскъпява
            STP кабела.
          </li>
          <img
            style={{ width: '20%' }}
            src="https://www.keline.com/assets/images/produkty/full/600-ke550hs231e-dca-1.jpg"
          ></img>
          <li>
            <b>- Фолио-екранирана усукана двойка (Foiled Twisted Pair – FTP)</b>
            <br />
            Това е кабел с усукани двойки, който е по-евтин от STP. Екранът е
            един – общ за всичките двойки проводници. Неговата изолация е от
            по-качествена пластмаса спрямо UTP кабела, предназначена за външен
            монтаж. Има копринена нишка или стоманен проводник за увеличаване на
            здравината.
          </li>
          <img
            style={{ width: '20%' }}
            src="https://image.made-in-china.com/2f0j00bNytOKJseFkR/CAT6-FTP-Cable-with-305m-24AWG-23AWG-Cu-CCA-Grey.jpg"
          ></img>
          <li>
            <b>- SFTP (Screened Fully-shielded Twisted Pair)</b>
            <br />е друг тип кабел с усукани двойки. Има екран от алуминиево
            фолио и метална оплетка. В средата има носещо пластмасово ядро,
            стоманена и копринена нишка. Подходящ за външен и вътрешен монтаж в
            помещения с високо ниво на смущения и високи изисквания за
            надеждност.
          </li>
          <img
            style={{ width: '20%' }}
            src="https://www.keline.com/assets/images/produkty/full/630-ke1000hs23-b2ca-cable.png"
          ></img>
        </ul>
      </center>
      <h2>Категории кабели с усукани двойки проводници</h2>
      <p>
        Има различни категории окабеляване с усукана двойка, като всяка от тях е
        разработена да предава данни с различна скорост. Следващата таблица
        показва шестте основни категории на усуканата двойка.
      </p>
      <center>
        <img
          style={{ width: '32rem' }}
          src="https://www.firewall.cx/images/stories/cabling-utp-categories.png"
        ></img>
      </center>
      <h2>Хардуер за свързване на кабели с усукани двойки</h2>
      <p>
        Кабелите с усукана двойка се свързват към компютри и други устройства,
        използвайки конектор RJ-45. RJ (Registered Jack – регистриран жак)
        конекторът се нарича така, защото е регистриран от Федералната комисия
        по комуникации на САЩ. Този конектор изглежда подобно на конектора на
        телефонната линия – RJ-11 с тази разлика, че е малко по-голям. Той има 8
        кабелни връзки, докато при RJ-11 те са само 4. Конекторът RJ-45 се
        монтира към кабел с усукани двойки проводници с помощта на специални
        клещи за кримпване.
      </p>
      <center>
        <img
          style={{ width: '20rem' }}
          src="https://instrumentic.info/img/cable-rj45-bg.webp"
        ></img>
      </center>
      <h2>Монтаж на конектор RJ-45 към кабел с усукани двойки проводници</h2>
      <p>
        UTP кабелът се състои от 4 двойки от усукани кабели с цветови кодове.
        При монтаж на конектора трябва да се има предвид цветовата подредба на
        проводниците. По стандарт има две цветови схеми – Т568А и Т568В.
      </p>
      <center>
        <img
          style={{ width: '20rem' }}
          src="https://blogger.googleusercontent.com/img/a/AVvXsEgfpTBL4vPgfT7ZxBQMTKTkzmJvIYryavffiVuWUl0q9dniRPSh4k1KH7iOLsy22BpvHejCRE6GXraj32QlZvJq3PWaprUW6LiylbaYEvRbGLC3eMPe9Q7bei3kSKGRRZLg8Z6_wp7z0R7VzduGGbFLJdrmQYZ5wrew4jNEi8YKt-_8YpsxUHUzIaD_=s16000"
        ></img>
      </center>
      <p>
        За направата на прав кабел трябва да се използва една и съща цветова
        схема от двете страни на кабела. За направата на кръстосан кабел единият
        край на кабела се свързва по едната схема, а другия – по втората. Прав
        кабел се използва за свързване на компютър към хъб или суич. Кръстосан
        кабел се използва за свързване на два компютъра директно един с друг,
        както и за свързване на два хъба (суича).
      </p>
      <h2>Оптичен кабел</h2>
      <p>
        Оптичният кабел (fiber-optic) се различава от останалите форми на
        мрежово окабеляване, защото предава импулси от светлина, а не
        електрически импулси. Това позволява много по-високи скорости на
        трансфер на данните – оптичният кабел може да предава данни със скорост
        до 40 Gbps. Този кабел се използва за опорни сегменти за дълги
        разстояния, които могат да свързват градове или държави.
      </p>
      <center>
        <img
          style={{ width: '20rem' }}
          src="https://5.imimg.com/data5/TJ/ER/MY-49320447/fiber-optic-cable-500x500.jpg"
        ></img>
      </center>
      <p>
        Оптичният кабел се състои от едно или повече стъклени или пластмасови
        влакна, които предават светлината. Множество влакна могат да бъдат
        включени в един оптичен кабел, което позволява множество мрежи да
        предават данни по него. Всяко влакно е оградено от защитен метален слой,
        обвит в слой пластмаса, наречен буфер. Най-отвън има твърда пластмасова
        обвивка. Влакнесто оптичните кабели осигуряват шумоустойчивост на
        сигналите и безпогрешно предаване на големи разстояния при най-високо
        ниво на защита на информацията в мрежата. Оптичните кабели са
        най-скъпото окабеляване. Освен самата му себестойност, най-големите
        разходи по използването му са свързани с човешкия труд – с оптически
        кабел се работи много по-трудно, а за снаждането на отделните нишки се
        изискват специално обучени техници и съответно инструмент за заваряване
        на влакната – сплайсер.
      </p>
      <h3>Режими на работа на оптичните кабели</h3>
      <ul>
        Оптичният кабел може да работи в един от следните два режима:
        <li>
          - <b>Единичен режим (Single mode)</b> – светлината пътува по оста на
          кабела. По-бърз режим, използва се предимно в WAN мрежите за
          разстояния до 70 км.
        </li>
        <li>
          - <b>Множествен режим (Multi mode)</b> – светлинните вълни навлизат в
          стъкления канал под различни ъгли като непрекъснато се отразяват и
          отскачат от стените на стъклената тръба. По-бавен от единичния поради
          дисперсията на светлината. Използва се в LAN мрежите за разстояния до
          2000 м.
        </li>
      </ul>
      <h2>Безжична преносна среда</h2>
      <ul>
        Безжичните компютърни мрежи стават все по-популярни в наши дни. Те имат
        редица предимства:
        <li>- отпада необходимостта от окабеляване</li>
        <li>- компютрите не се обвързват с конкретно работно място</li>
        <li>- лесно се включва нов компютър към мрежата.</li>
      </ul>
      <h3>Лазер (Laser)</h3>
      <p>
        Лазерът ни е познат от различни устройства – принтери, мерници за
        оръжия, посочващи устройства, хирургически инструменти. Технологията се
        основава на усилване на светлината чрез стимулирана емисия на лъчение.
        Лазерният генератор излъчва поле от електромагнитна енергия, в която
        всички вълни са с еднаква честота и са подредени във фаза. Различните
        типове лазери произвеждат лъчи с различна дължина на вълната. Сигналът
        при лазерните мрежи представлява импулси от лазерна светлина. Самата
        технология изисква пряка видимост между две устройства за осъществяване
        на комуникация. Това е и основният недостатък на лазерните безжични
        комуникации. FSO (Fiber Space Optics) е безжична оптическа технология,
        която използва лазерна светлина за предаване на данни между две точки.
        Тези технологии са създадени за военни и космически приложения и едва в
        последните години имат по-голямо приложение. Обикновено се използва
        инфрачервен или червен лазер. Повечето системи работят на първо или
        второ ниво от OSI модела – това означава, че те създават прозрачно
        продължение на LAN без необходимост от специфичен софтуер. Скоростта на
        пренасяната информация зависи от качеството на преносната среда. Във
        вакуум пренасянето на информация с насочен лазер не се различава
        съществено от пренасянето на информация чрез оптически кабел и
        скоростите на трансфер, които могат да се постигнат са приблизително
        същите – до няколко гигабита. В атмосферата е възможно предаване на
        информация със скорост до 10Mbps. (Пример: http://ronja.twibright.com/
        10Mbps на 1.4km) Нарушените атмосферни условия – дъжд, сняг, мъгла,
        светкавици и др. – пречат на трансфера. Начин за намаляване на грешките
        е чрез дублиране на информацията – увеличаване на броя на излъчвателите
        и приемниците.
      </p>
      <ul>
        Най-сериозните проблеми пред технологията FSO са:
        <li>
          - Пряко слънчево лъчение – за възпрепятстване на слънчевите лъчи се
          използват козирки, филтри.
        </li>
        <li>
          - Стабилност на насочването. Дори промяна в насочването с част от
          градуса е фатално. Крепежните елементи, самите сгради имат
          температурно разширение, което води до грешки в насочването. Избягва
          се с автоматична насочваща система или разширяване на лъча.
        </li>
        <li>
          - Наличие на вибрации с честота под 10Hz – това е проблем при
          изграждане на високи кули. Дори при високите сгради – над 10 етажа има
          вибрации, причинени от самата сграда, от ходене, строителни работи и
          други.
        </li>
      </ul>
      <h3>Инфрачервени лъчи (Infrared – IrDA)</h3>
      <p>
        Използват се при дистанционните устройства на телевизорите, мобилни
        телефони, аудио и видеотехника. Сигналът за пренос на информация
        представлява съвкупност от лъчи в инфрачервения спектър.
      </p>
      <ul>
        За изграждане на компютърна мрежа се използват устройства по
        спецификациите IrDA (Infrared Data Association). Разстоянията между
        излъчвателя и приемника са от 5cm до 60cm. IrDA е FSO технологията с
        най-малък обсег. Използват се няколко основни категории устройства,
        определящи различните нива на скорост на обмена:
        <li>
          - SIR (Serial Infrared) предлага скорости, нормално поддържани от
          серийния порт RS-232 (9600bps, 19200bps, 38400bps, 57600bps и
          115200bps);
        </li>
        <li>
          - MIR (Medium Infrared) не е официална категория. Устройствата
          предлагат скорости 0.576 Мbps и 1.152 Mbps;
        </li>
        <li>- FIR (Fast Infrared). Скорост до 4Mbps.</li>
        <li>- VFIR (Very Fast Infrared). Скорост до 16Mbps.</li>
        <li>
          - UFIR (Ultra Fast Infrared). Това е последната категория, която в
          момента се разработва. Тя обещава скорости до 100Mbps.
        </li>
      </ul>
      <h3>Радиовълни</h3>
      <p>
        Най-общо технологиите за изграждане на безжична компютърна мрежа чрез
        използване на радиовълни в гигахерцовия обхват се разделят на:
        <br />
        - PAN – технология за изграждане на безжична персонална мрежа
        <br />
        - WLAN – технология за изграждане на безжична локална мрежа
        <br />- WWAN – технология за изграждане на безжична глобална мрежа.
      </p>
      <h3>WPAN - Bluetooth устройства</h3>
      <p>
        Безжичната технология Bluetooth[1] е предназначена за връзка между
        компютри, телефони и мобилни аксесоари на къси разстояния, създавайки
        персонална локална мрежа (PAN – Personal Area Network). Тя е проектирана
        да замести кабелните връзки между устройствата, предлагайки висока
        степен на защита на информацията. Основните й характеристики са: ниско
        ниво на енергопотребление, ниска цена. Също както и безжичните мрежи
        802.11b, 802.11g тя работи в свободния от лицензиране радиочестотен
        диапазон 2400-2483.5 MHz., но използва различна модулационна техника.
        Радио-честотите са разделени на 79 RF канала, номерирани от 0 до 78,
        всеки канал е изместен с 1MHz, започвайки от 2402MHz. Използват се два
        метода на модулиране. При базовия Bluetooth се използва GFSK (Gaussian
        Frequency-Shift Keying) – модулиране с изместване на честотата.
        Различните двоични стойности се модулират с различна честота, като
        отклонението е не по-малко от 115kHz. За намаляване на ефекта от
        радио-интерференция и за осигуряване на защита от подслушване се
        използва модулацията FHSS (Frequency Hopping Spread Spectrum). Това е
        прост, лесно реализируем метод – информацията се разделя на времеви
        слотове, всеки с продължителност 625ms. Честотата на всеки слот се
        променя псевдослучайно, като схемата е известна само на предавателя и
        приемника.
      </p>
      <h3>WLAN</h3>
      <p>
        За изграждане на WLAN се използват широко разпространените Wi-Fi
        технологии. Те се основават на групата стандарти IEEE 802.11. В момента
        се използват шест техники на модулация на радио-сигналите, като трите
        най-популярни са дефинирани в стандартите 802.11a, 802.11b и 802.11g.
        Технологиите 802.11b и 802.11g използват свободна от лицензиране
        честотна лента около 2.4GHz, като може да се получи интерференция с
        безжични телефони, Bluetooth устройства и микровълнови печки. В много
        страни честотната лента 2.4GHz е претоварена или заета. Затова 802.11a
        използва диапазона над 5GHz. Недостатък за тези устройства е
        необходимост от пряка видимост между устройствата, висока степен на
        поглъщане от сгради и предмети. Това налага повишаване на предавателната
        мощност – което не се вписва в идеята за използване на технологията в
        мобилни компютри с ниско ниво на енергопотребление.
      </p>
      <center>
        <img
          style={{ width: '32rem' }}
          src="https://forum.huawei.com/enterprise/en/data/attachment/forum/202202/08/195949awe6jb9e2tjjpkug.png"
        ></img>
      </center>
      <h3>WWAN</h3>
      <p>
        Безжичните глобални мрежи използват 2G и 3G технологиите, изграждащи на
        мрежи от клетъчни телефони (wide area cellular telephone networks).
        Такива са GSM (9600bps), GPRS (2G) – 56 и 114 kbps, UTMS (3G) downlink
        до 384 kbps и uplink до 64 kbps, CDMA2000 (3G) – до 1.8 Mbps, HSDPA
        (3.5G) – 1.8, 3.6, 7.2 и 14.4 Mbps.
        <br /> Една нова технология обещава да завладее пазара на безжичните
        клетъчни мрежи – WiMax. Изградена е на базата на IEEE стандартите
        802.16. Основният стандарт използва диапазона от радиочестоти 10-66 GHz.
        От версия 802.16d през 2004 г. радиодиапазонът е променен – 2-11GHz.
        Този стандарт се нарича „фиксиран WiMax”, понеже не осигурява мобилност
        на устройствата. Усъвършенстваният през 2005 г. 802.16e вече е „мобилен
        WiMax”. Използването на технологията OFDM (orthogonal frequency-division
        multiplexing) понижава интерференцията, улеснява филтрацията на шум,
        подобрява енергийната ефективност. Реално WiMax технологията се използва
        за разстояния от 5 до 8 km при скорости от 512 Кbps до 2 Mbps. <br />
        За изграждане на безжични връзки на големи разстояния се използват и
        мостове (wireless bridges) работещи в стандарта 802.11 с насочени
        антени. С устройства от най-висок клас (съответно цена) могат да се
        достигнат ефективно разстояния до 15 km при 2.4 GHz и до 30 km при 5GHz
        устройства.
      </p>
      <h1>Мрежова карта</h1>
      <p>
        Основен компонент, необходим за включването на един компютър в мрежа
        това е мрежовата интерфейсна карта – NIC (Network Interface Card).
        Нарича се още мрежова адаптерна карта. Тя може да бъде самостоятелна
        платка , която се инсталира към свободен слот на дънната платка, или да
        бъде вградена в дънната платка на компютъра. При мрежи с кабелна
        преносна среда към външните конектори на адаптера се свързват мрежовите
        кабели чрез които компютърът комуникира с останалите устройства в
        мрежата. Безжичните мрежови карти използват антена.
      </p>
      <center>
        <img
          style={{ width: '38rem' }}
          src="https://2.bp.blogspot.com/-5AGPIszn-4I/WQdG0XTYFYI/AAAAAAAAEK4/B-Q0Ws_1nWUuu0UcDov3IvlY0DQUCKlvACLcB/s1600/nic%2Btype.jpg"
          alt=""
        ></img>
      </center>
      <h3>Предназначение</h3>
      <ul>
        Основните функции на мрежовата карта са свързани с:
        <li>- подготовка на данните за изпращане от компютъра към мрежата;</li>
        <li>
          - управлението на потока от данни между компютъра и преносната среда;
        </li>
        <li>- приемане на входящите данни.</li>
      </ul>
      <p>
        Мрежовата карта осъществява преобразуване на паралелния сигнал от
        компютъра в серийна (последователна) форма, която се изпраща по мрежовия
        кабел. Цифровият сигнал се преобразува в електрически импулси, светлинни
        импулси или радиовълни, взависимост от преносната среда, която се
        използва. При получаване на сигнал от мрежата се извършва обратното
        преобразувание в цифров сигнал. Преобразуванието се осъществява от
        устройство, наречено трансийвър (transceiver) – приемо-предавателно
        устройство.
      </p>
      <h2>Мрежови адрес</h2>
      <p>
        Всяка мрежова карта има уникален адрес наречен MAC (Media Access
        Control) адрес. Този адрес се записва от производителя в чипа на
        мрежовата карта. Мрежовите адреси се определят от комитета IEEE. <br />
        MAC адресът се използва при изпращане на информация от един компютър към
        друг. Към данните, които мрежовата карта изпраща към мрежата се добавя и
        MAC адреса. По този адрес останалите устройства от мрежата различават
        данните от коя мрежова карта са изпратени и за коя са предназначени.
        <br /> MAC адресът представлява 48 битово число. Представя се като 6
        шестнадесетични числа разделени с тирета – например 00-aa-00-62-c6-09.
      </p>
      <h3>Избор на мрежова адаптерна карта</h3>
      <ul>
        При избор на мрежова адаптерна карта трябва да се имат впредвид
        следното:
        <li>- мрежова архитектура;</li>
        <li>- тип на преносната среда;</li>
        <li>- скорост на предаване на данните;</li>
        <li>- тип на свободен разширителен слот;</li>
        <li>- операционна система;</li>
      </ul>
      <h3>Mрежова архитектура</h3>
      <p>
        Мрежовата карта трябва да работи с избраната мрежова архитектура. Ако
        мрежовата архитектура е Token Ring, в съответната мрежа не може да се
        използва Ethernet мрежова карта. В момента се използва основно Ethernet
        архитектура.
      </p>
      <h3>Tип на преносната среда</h3>
      <p>
        Мрежовата карта е различна за всеки различен вид преносна среда. При
        кабелна преносна среда конекторът на картата трябва да съвпада с
        конектора на кабела.
      </p>
      <center>
        <img
          style={{ width: '30%' }}
          src="https://www.computernetworkingnotes.org/images/networking-tutorials/nt10-02-types-of-nic-cards.jpg"
          alt=""
        />
      </center>
      <h3>Скорост на предаване на данните</h3>
      <p>
        Всяка мрежова карта поддържа набор от скорости и начин на дуплексиране.
        При свързване на две карти те се „уговарят” (negotiate) за типа на
        мрежовата връзка (connection type) и скоростта на предаване. Например
        една 10Mbps мрежова карта няма да може да работи със 100Mbps хъб, но ще
        работи с 10/100Mps суич.
        <br />
        Дуплексиране е възможността да се предава информация едновременно в
        двете посоки. При полу-дуплекс (half duplex) мрежовата карта не може
        едновременно да приема и предава информация, а при пълен дуплекс (full
        duplex) това е възможно. Пълният дуплекс е възможен при използване на
        кабели с усукана двойка, тъй като се използват различни чифтове за
        приемане и за предаване на данни.
      </p>
      <h3>Тип на свободен разширителен слот</h3>
      <p>
        Повечето мрежови карти (с изключение на тези с USB интерфейс) се
        поставят на свободен слот на дънната платка на компютъра. Взависимост от
        това на какъв слот ще бъде поставена мрежовата карта, дали компютърът е
        настолен или преносим, се избира и мрежовата карта да бъде със
        съответния интерфейс. Съществуват следните разширителни шини:
      </p>
      <ol style={{ listStyle: 'inside' }}>
        <li>ISA – 16 битов разширителен слот, черен цвят, не се използва;</li>
        <li>
          PCI – 32 битова архитектура, използвана в съвременните компютри.
          Поддържа Plug and Play устройства. Слотът е с бял цвят.
        </li>
        <li>
          PCMCIA – входно/изходна шина за мобилни компютри – работи с устройства
          с големината на кредитна карта (85.6 x 54.0 mm). Остарял интерфейс,
          заменя се от ExpressCard.
        </li>
        <li>
          ExpressCard – устройствата са с два размера – ExpressCard/34 (34 x 75
          x 5 mm) и ExpressCard/54 (54 x 75 x 5 mm). Устройствата се свързват
          към PCI-Express (2.5Gbps) или към USB 2.0 (480Kbps).
        </li>
        <li>USB – Безжичните мрежови карти с USB интерфейс са предпочитани.</li>
      </ol>
      <h3>Oперационна система OS</h3>
      <p>
        При избор на мрежова карта трябва да се има впредвид и това дали
        производителят на мрежовата карта осигурява драйвери за съответната
        операционна система.
      </p>
    </div>
  );
};

export default Cables;
