import React from 'react';

function Devices() {
  return (
    <div>
      <p>
        До момента се запознахме с основните мрежови компоненти – кабели,
        конектори и мрежови интерфейсни карти. Освен тях при изграждането на
        компютърните мрежи се налага да използваме и допълнителни устройства за
        свързване – хъбове, концентратори, маршрутизатори, модеми и т.н. В
        настоящата тема ще разгледаме три типа устройства за свързване:
      </p>
      <ul style={{ listStyle: 'inside' }}>
        <li>Пасивни устройства;</li>
        <li>Активни устройства;</li>
        <li>Устройства за разделяне на сегменти и подмрежи.</li>
      </ul>
      <h2>Пасивни устройства</h2>
      <ul style={{ listStyle: 'inside' }}>
        Тези устройства само осигуряват точката на свързване без да модифицират
        или усилват сигнала. Към тази група се отнасят:
        <li>Свързващи букси (jack couplers);</li>
        <center>
          <img
            style={{ width: '32rem' }}
            src="https://sep.yimg.com/ay/kvm-switch/nti-rj45-ff-snp-shld-2.gif"
            alt=""
          ></img>
          <p>
            Тези пасивни устройства се използват ограничено за удължаване на
            мрежов кабел. Възможно е при това кабела да се кръстоса, за да бъде
            подходящ за връзка компютър-компютър.
          </p>
        </center>
        <li>Розетки (wall plates);</li>
        <center>
          <img
            style={{ width: '32rem' }}
            src="https://mladtehnik.com/image/cache/catalog/5_BUKSI_I_KLEMI/BUKSI/TELEFONNI_SYEDINITELI_RJ11/16525-A-600x550.JPG"
            alt=""
          ></img>
          <p>
            Розетката е свързващ панел за едно работно място. Състои се от един
            или два порта. Има вариант за вътрешен и външен монтаж. Изработени
            са от пластмаса. В портовете могат да се поставят инсърти – както
            RJ-45, така и RJ-11. Така може една розетка да предоставя до едно
            работно място връзка към локалната мрежа и към телефонната централа.
          </p>
        </center>
        <li>Свързващи панели (patch panels);</li>
        <center>
          <img
            style={{ width: '32rem' }}
            src="https://shop.negs.bg/1818-large_default/pach-panel-12-porta-ftp-cat5e-10-1u-efb.jpg"
            alt=""
          ></img>
          <p>
            Представляват свързваща и разпределяща точка, използвана за
            организиране на кабелите, които идват заедно на едно централно
            място.
            <br />
            При мрежите с топология тип „звезда” кабелите от компютрите достигат
            до задната част на свързващия панел. Отпред се намират RJ-45
            жаковете, в които се включват кабелите, свързани с хъба или суича.
            Свързващият панел обикновено се поставя в специален шкаф (rack
            shelves). При структурно окабеляване на сграда на всички работни
            места се поставят RJ-45 розетки, които се опроводяват до свързващия
            панел. Връзката свързващ панел – суич се осъществява чрез къси patch
            кабели.
            <br />
            Свързващите панели се състоят от рамка и инсърти. Рамките са за 16,
            32 или 64 порта, като не всички се използват – т.е. не на всички се
            поставят инсърти.
          </p>
        </center>
        <li>Пасивни хъбове (passive hub).</li>
        <center>
          <img
            style={{ width: '32rem' }}
            src="https://cdn.jmt.bg/images/products/31000/full/111495/dahua-pft1300.jpg"
            alt=""
          ></img>
          <p>
            Хъб (Hub), или още наречен концентратор, е централно свързващо
            устройство, чрез което се осъществява връзка между множество
            компютри в една мрежа.
            <br />
            Пасивният хъб не съдържа електроника и не изисква захранване.
            Пристигналият сигнал на някой от портовете му се препраща към всички
            останали портове на хъба.
            <br /> В момента не се произвеждат и използват пасивни хъбове.
          </p>
        </center>
      </ul>
      <h2>Активни хъбове</h2>
      <center>
        <img
          src="http://pgds.org/books/km/03_files/image016.jpg"
          style={{ width: '32rem' }}
        />
        <p>
          Активният хъб представлява многопортов повторител, защото разполага с
          множество портове подобно на пасивния хъб и в същото време усилва
          всеки постъпил сигнал на някой от портовете му, преди да го предаде
          към всички останали портове. Хъбовете работят във физическия слой на
          мрежовия модел OSI.
        </p>
      </center>
      <h2>Мостове</h2>
      <p>
        Традиционният мост (bridge) е устройство, което свързва два сегмента от
        една локална мрежа. Неговата основна задача е да филтрира трафика между
        двата сегмента, с цел да се намали претоварването при една по-голяма
        локална мрежа.
        <br /> Мостовете могат да бъдат самостоятелни устройства или да се
        реализират като хардуер и софтуер в един компютър. След разделяне на
        голямата мрежа на две по-малки, трафиците на сегментите ще бъдат
        изолирани и няма да си влияят взаимно.
      </p>
      <ul style={{ listStyle: 'inside' }}>
        Мостовете работят с физически MAC адреси. В моста се изгражда таблица с
        адреси на компютрите от двата сегмента като се изпълняват следните
        стъпки:
        <li>
          Когато в моста постъпи пакет с информация, се извършва проверка за
          адреса източник и адреса местоназначение. В таблицата е записано в кой
          сегмент е разположен всеки адрес.
        </li>
        <li>
          Ако адресът местоназначение липса в таблицата, пакетът се изпраща и до
          двата сегмента. Ако липсва адреса източник, мостът го добавя в
          таблицата.
        </li>
        <li>
          Ако адресът местоназначение е записан в таблицата, тогава мостът
          препраща пакета към съответния сегмент.
        </li>
        <li>
          В случай, че двата адреса – на източника и на местоназначението са в
          един сегмент, мостът не препраща пакета към другия сегмент.
        </li>
        <li>
          Мостовете са „невидими” за компютрите включени в мрежата. Две локални
          мрежи, свързани чрез мост са физически отделни, но логически образуват
          една мрежа.
        </li>
        Мостовете работят в каналния слой на мрежовия модел OSI – на ниво пакети
        от данни. Те не променят структурата и размера на пакетите. Прочитат MAC
        адреса на получателя и определят към кой порт да пренасочат пакета.
        Времезакъснението за препредаване е много малко – съответно
        производителността – много голяма.
        <br />
        <li>
          При мрежи изградени с хъбове за ограничаване на паразитно пренасяната
          информация или за свързване на две отдалечени локални мрежи в една;
        </li>
        <li>При свързване на различни Ethernet мрежи;.</li>
        <li>При свързване на отдалечени локални мрежи.</li>
      </ul>

      <h2>Комутатори</h2>
      <p>
        Комутаторът (на английски switch, суич), е най-масово използваното
        устройство за свързване на компютри в мрежа с топология „звезда”.
        Комутаторът увеличава скоростта на мрежата и е сравнително евтино
        устройство. Много прилича на активния хъб, но е по-интелигентно
        устройство от него. Докато при хъба полученият сигнал се препраща до
        всички портове, то при комутатора информацията се филтрира и изпраща
        само до устройството за което е предназначена. Комутаторът е многопортов
        мост.
      </p>
      <center>
        <img
          style={{ width: '32rem' }}
          src="https://cameri.eu/userfiles/productlargeimages/product_5438.jpg"
        ></img>
      </center>
      <p>
        Комутаторът работи по следния начин:
        <br />
        При получаване на един пакет на даден порт от комутатора, той прави
        проверка за това дали пакетът е коректно получен, след което проверява в
        собствената си таблица дали има направен запис за MAC-адреса на
        получателя. Възможните варианти са два:
      </p>
      <ul>
        <li>
          <b>Няма запис на MAC адреса.</b> В този случай комутаторът изпраща
          пакета към всичките си портове, след което получава отговор от
          устройството за което е предназначен пакета. Тогава той записва в
          таблицата си на кой изходен порт отговаря този MAC- адрес. Всички
          следващи пакети с този адрес се препращат директно на съответния порт.
        </li>
        <li>
          <b>Съществува запис на MAC адреса.</b> Комутаторът препраща пакета
          директно към съответния порт. Съществуват три вида адреси на
          получателя – broadcast, multicast, unicast. При broadcast адрес
          пакетът се изпраща на всички портове. При multicast адрес пакетът се
          изпраща на предварително определени портове – multicast се използва за
          Video on demand, Conference call, Video conference. При unicast адрес,
          пакетът се изпраща само към едно устройство (един порт). В резултат на
          това се формира виртуална връзка между подател и получател, никой друг
          възел (с изключение на свързващите устройства по пътя на пакета) не
          вижда информацията, обменяна между получател и подател. Този механизъм
          на работа повишава сигурността на мрежата и капацитета й.
        </li>
      </ul>
      <p>
        Комутаторите са няколко типа. Те се категоризират на базата на слоя в
        OSI модела, на който работят. Стандартните комутатори работят в слой 2
        от OSI модела. Съществуват обаче и подобрени комутатори, които работят в
        слой 3 или 4. Това са маршрутизатори, но от специален тип, които
        изпълняват ролята и на комутатори. При тях обикновено е възможно да се
        лимитира връзка до един MAC адрес, да се ограничи скоростта на трансфер
        за връзка и др.
      </p>
      <h2>Маршрутизатори</h2>
      <p>
        Маршрутизаторът (на английски: router, рутер) е самостоятелно
        устройство, което служи за управление на разпределянето на трафика
        (пакетите) информация между различни мрежи или различни сегменти от
        дадена мрежа. Маршрутизаторът работи на слой 3 (мрежови) от седемслойния
        OSI модел. Тоест, маршрутизаторът работи с логически IP адреси, а не с
        MAC адреси, по което се различава от хъба или моста. Ако до някое
        устройство в мрежата връзката е през маршрутизатор, а не през суич или
        хъб, то ние не научаваме неговия MAC адрес.
      </p>
      <center>
        <img
          style={{ width: '32rem' }}
          src="https://s13emagst.akamaized.net/products/24642/24641210/images/res_34759254bdd6b2649ac2b49dd9f7797a.png"
          alt=""
        ></img>
      </center>
      <p>
        Маршрутизаторите са по-интелигентни устройства – те могат да избират
        най-добрия маршрут до даден адрес измежду множество възможни пътища. За
        определяне на пътя за предаване на данните и насочване на пакетите
        маршрутизаторът използва таблица за маршрутизация, в която се съхраняват
        IP адресите на други маршрутизатори. Тази таблица маршрутизаторът си
        създава сам, като си набавя информация, а при някаква промяна сам я
        актуализира, „разпитвайки“ другите маршрутизатори кой докъде е свързан.
      </p>
    </div>
  );
}

export default Devices;
