import React from 'react';
import table from '../../constants/pictures/table1.png';
import table2 from '../../constants/pictures/table2.png';
import table3 from '../../constants/pictures/table3.png';
import table4 from '../../constants//pictures/table4.png';
import table5 from '../../constants/pictures/table5.png';
import table6 from '../../constants/pictures/table6.png';
import table7 from '../../constants/pictures/table7.png';
import table8 from '../../constants/pictures/table8.png';

function Ip() {
  return (
    <div>
      <h1>Протоколът IP</h1>
      <h2>TCP/IP</h2>
      <p>
        TCP/IP е основният мрежов протокол, който се използва в глобалната мрежа
        Интернет. TCP/IP е съвкупност от два протокола, които работят в различни
        слоеве на мрежовия модел OSI – това са TCP (в транспортния слой) и IP (в
        мрежовия слой). Основно функциите на двата протокола се свеждат до
        транспортиране на данните между мрежовите устройства. <br />
        За да може информацията в мрежата да достигне успешно до получателя е
        необходимо всяко устройство в мрежата да има свой уникален адрес. Този
        адрес се обозначава като IP адрес.
      </p>
      <h2>IP адрес</h2>
      <p>
        IP (Internet Protocol) адресът е логически адрес, който се присвоява на
        всеки хост в мрежата. Един хост може да има няколко мрежови карти
        (няколко интерфейса). Всеки от тези интерфейси притежава собствен IP
        адрес. Например, всеки компютър притежава loopback интерфейс, чийто IP
        адрес е 127.0.0.1.
        <br />
        Хост, който има реален IP адрес има достъп до всички услуги в Интернет,
        също така може да предлага услуги. Достъп до Интернет може да се
        извършва чрез посредник (програма proxy или NAT). Единствено посредникът
        има реален адрес, другите хостове имат частни IP адреси. В този случай
        потребителите могат да ползват, но не могат да предлагат интернет
        услуги. За разпределянето на адресите в глобалната мрежа Интернет
        отговаря американската организация IANA (Internet Assigned Numbers
        Authority). В рамките на една локална мрежа, IP адресите трябва да са
        уникални. Компютрите в локалните мрежи, непредставляващи част от
        Интернет, трябва да използват частни IP адреси.
      </p>
      <h3>IPv4 адрес</h3>
      <p>
        Всеки IP адрес се представя вътрешно в компютъра като двоично число. При
        IPv4 протоколът се използва 32 битово адресиране. Тъй като двоичният
        запис е по-труден за възприемане, IP адресът се представя в
        десетично-точков формат. 32 битовият адрес се записва като поредица от
        четири 8 битови числа (октети). Всеки един от тези октети може лесно да
        се преобразува в десетично число. След това октетите се разделят с
        точка. <br />
        Например IP адресът
      </p>
      <p style={{ letterSpacing: 3 }}>11000000 10101000 00000000 00000001</p>
      <p>
        се записва като 192.168.0.1.
        <br />
        Числата в октетите могат да бъдат от 0 до 255 (2<sup>8</sup>-1).
        Четирите октета се обозначават като w.x.y.z. За едно 32 битово число
        възможните комбинации са 2<sup>32</sup> или 4 294 967 296 на брой
        компютри могат да се включат в една мрежа.
      </p>
      <ul style={{ listStyle: 'inside' }}>
        Компютър с нулев адрес (не асоцииран с IP адрес) се изписва като:
        <li>0.0.0.0</li>
        Специалният loopback адрес, означаващ „този компютър” е:
        <li>127.0.0.1</li>
      </ul>
      <h3>IPv6 адрес</h3>
      <p>
        При протоколът IPv6 се използва 128 битов адрес. Това е нов стандарт за
        адресиране, нарича се още Интернет протокол от следващо поколение IPng
        (IP Next Generation). Адресът от версия 6 се представя като осем 16
        битови двоични числа. 16 битовите числа се записват в шестнадесетична
        бройна система и се разделят помежду си с двоеточия.
      </p>
      <ul style={{ listStyle: 'inside' }}>
        Например
        <li>1080:0:0:0:0:800:0:417A</li>е запис на IP адрес при протокола IPv6.
        <br />
        Нулите могат да не се изписват:
        <li>1080::800:0:417A</li>
        Компютър с нулев адрес се изписва като:
        <li>::</li>
        Специалният loopback адрес, означаващ „този компютър” е:
        <li>::1</li>
        При 128 битовия адрес възможните комбинации са 2<sup>128</sup>
      </ul>
      <h3>IP адресиране</h3>
      <p>
        IP адресът е съвкупност от две части – адрес на мрежата, в която е
        включено устройството и адрес на самото устройство. Например в IPv4
        адреса 74.125.39.147 първите три октета идентифицират адреса на мрежата.
        Последното число е адреса на компютъра. Всички компютри включени в тази
        подмрежа ще имат един и същ мрежови адрес (74.125.39).
      </p>
      <center>
        <img src="http://pgds.org/books/km/14_files/image002.gif"></img>
      </center>
      <p>
        При изпращане на съобщение в Интернет до компютър с IP адрес
        74.125.39.147 първата задача на мрежовите протоколи е да транспортират
        данните до подмрежата с адрес 74.125.39. След като пакетите с информация
        се "доставят" до тази мрежа се извършва вътрешно маршрутизиране, така че
        те да достигнат до компютър с адрес 147.
        <br />В разгледания пример първите три октета са за мрежовия адрес. Това
        обаче не винаги е така. Частта за мрежовия адрес и частта за адреса на
        компютъра се определят от класа на IP адреса.
      </p>
      <h3>Класове IP Адреси</h3>
      <p>
        При 32 битовото адресиране възможните комбинации от адреси са 2
        <sup>32</sup>. Но на практика не всички адреси се използват. При IP
        адресирането са дефинирани 5 множества от IP адреси, които са известни
        като класове. При първите 3 класа, IP адресът включва мрежова част (N –
        net) и част за устройството (H – host).
      </p>
      <center>
        <img style={{ width: '32rem' }} src={table}></img>
      </center>
      <h3>Клас А</h3>
      <p>
        Мрежова част - заделен е един октет. Мрежовият адрес започва
        задължително с 0 (в двоична бройна система), като по този начин
        възможните числа са 2<sup>7</sup> или 128. Два адреса са забранени за
        използване – 0 и 127. Така допустимите стойности за мрежови адрес са 126
        на брой.
        <br />
        Част за устройството – остават три октета за адреса на устройството (24
        бита). Възможните стойности са 2<sup>24</sup> = 16 777 216. От тях
        първият и последният адрес не се използват. Остават общо 16 777 214
        адреса. Това е и броят на устройствата, които могат да се включват в
        мрежа от Клас А.
      </p>
      <h3>Клас В</h3>
      <p>
        Мрежова част – включва два октета. Мрежовият адрес започва задължително
        с 10 при неговото двоично представяне, при което стойностите на първия
        октет могат да бъдат в диапазона 128 – 191. За представяне на мрежовия
        адрес остават 14 бита. Възможните стойности за мрежови адреси са 2
        <sup>14</sup> = 16 384.
        <br />
        Част за устройството – остават два октета или 16 бита - 2<sup>16</sup> =
        65 536 възможни стойности. От тях два адреса са забранени – първият и
        последният. Остават допустими 65 534 на брой адреси за устройства.
      </p>
      <h3>Клас С</h3>
      <p>
        Мрежова част – състои се от три октета или 24 бита. Първите 3 знака на
        първия октет са 110, което определя и стойностите на първия октет да
        бъдат в диапазона между 192 и 223. Остават 21 бита за представяне на
        мрежовия адрес. Броят на възможните мрежи от Клас С е 2<sup>21</sup> = 2
        097 152.
        <br />
        Част за устройството – остава 1 октет (8 бита) – 2<sup>8</sup> = 256 на
        брой възможни стойности. Първият и последният адрес са забранени за
        използване. Така остават 254 на брой възможни устройства за свързване в
        мрежа от Клас С.
      </p>
      <h3>Клас D</h3>
      <p>
        Адресите от клас D са резервирани за multicast използване и не могат да
        се използват за присъединяване на адреси на устройства. Първият октет
        започва с 1110 в двоичен код и съответно стойностите на първия октет са
        в диапазона 224 – 239. Останалите 28 бита се използват за идентифициране
        на multicast групата.
      </p>
      <h3>Клас Е</h3>
      <p>
        Адресите от този клас са експериментални и не се използват за публични
        цели. Първият октет започва с 1111 в двоичен вид, при което стойностите
        за първия октет са между 240 и 255.
      </p>
      <center>
        <img style={{ width: '32rem' }} src={table2}></img>
      </center>
      <ul style={{ listStyle: 'inside' }}>
        <h3>Правила при IP адресирането</h3>
        <li>
          Всички устройства от един и същ физически мрежови сегмент трябва да
          имат еднакъв мрежови адрес;
        </li>
        <li>
          Всяко устройство от един мрежови сегмент трябва да има уникален адрес;
        </li>
        <li>
          Мрежовият адрес не може да бъде 127 – този адрес е запазен за loopback
          функции;
        </li>
        <li>
          Мрежовият адрес в двоичен вид не може да съдържа само единици – този
          адрес е запазен за broadcast функции;
        </li>
        <li>
          Адресът на устройството не може да съдържа само единици. Тези адреси
          са запазени за broadcast функции;
        </li>
        <li>
          Мрежовият адрес в двоичен вид не може да съдържа само нули. Този адрес
          означава цялата локална мрежа;
        </li>
        <li>
          Адресът на устройството не може да съдържа само нули. Когато частта за
          устройството съдържа само нули, а мрежовата част число различно от
          нула, тогава адресът като цяло се използва за обозначаване на
          локалната мрежа.
        </li>
      </ul>
      <h3>Мрежова маска</h3>
      <ul style={{ listStyle: 'inside' }}>
        Определя кои битове от IP адреса са за мрежовата част и кои за адреса на
        устройството. По подразбиране за клас А, В и С се използват следните
        подмрежови маски:
        <li>
          <b>Клас А – 255.0.0.0</b>
        </li>
        <li>
          <b>Клас В – 255.255.0.0</b>
        </li>
        <li>
          <b>Клас С – 255.255.255.0</b>
        </li>
      </ul>
      <p>
        Подмрежовата маска на клас А означава, че първите 8 бита определят
        мрежовата част, а останалите 24 са за частта на устройството.
      </p>
      <ul style={{ listStyle: 'inside' }}>
        Когато устройство А изпраща информация до устройство B в мрежата,
        устройството А използва подмрежовите маски, за да определи дали
        устройството В е в локалната или в друга мрежа. При това се извършват
        следните операции от устройство А:
        <li>
          Изпълнява се операция "логическо И" над две двоични числа – IP адреса
          на устройство А и подмрежовата маска на устройство А. Като резултат се
          получава мрежовия адрес на устройство А.
        </li>
        <li>
          Същите изчисления се извършват и с IP адреса на устройство В и
          подмрежовата маска на устройство В. Като резултат се получава мрежовия
          адрес на устройство В.
        </li>
        <li>Сравняват се двата мрежови адреса.</li>
        <li>
          Ако те съвпадат, от гледна точка на устройство А, то двете устройства
          се намират физически в една и съща мрежа и ще комуникират директно.
        </li>
        <li>
          Ако не съвпадат, то устройствата са в различни мрежови сегменти.
        </li>
      </ul>
      <h3>Пример</h3>
      <p>
        Устройство А е с IP адрес 192.168.1.5, устройство В – съответно
        192.168.2.6. Устройство А желае да изпрати информация до устройство В.
        Подмрежовите маски и на двете устройства са 255.255.0.0. Дали двете
        устройства ще комуникират директно или ще използват маршрутизатор?
      </p>
      <ul>
        IP адресът 192.168.1.5 представен в двоичен вид се записва така:
        <li style={{ letterSpacing: 3 }}>
          11000000 10101000 00000001 00000101
        </li>
        IP адресът 192.168.2.6 съответно изглежда така:
        <li style={{ letterSpacing: 3 }}>
          11000000 10101000 00000010 00000110
        </li>
      </ul>
      <>
        От устройство А се изпълнява операцията "логическо И" над следните
        операнди:
        <br />
        <center>
          <img style={{ width: '32rem' }} src={table3}></img>
          <br />
        </center>
        За устройство В резултатът е следния:
        <br />
        <center>
          <img style={{ width: '32rem' }} src={table4}></img>
        </center>
        <br />
        Двата резултата за устройства А и В съвпадат, т.е. мрежовите адреси са
        еднакви. Следователно устройствата са в една локална мрежа и ще
        комуникират директно помежду си.
      </>
      <h3>CIDR</h3>
      <p>
        CIDR (Classless Inter-Domain Routing) е метод на представяне на
        мрежовата и хост частта от IP адреса. Приема се нотация за изписване на
        мрежов адрес – CIDR блок. При този запис след мрежовия адрес се поставя
        наклонена черта и се изписват броя на битовете в мрежовия адрес.
        Примерно: 192.168.0.0/16 е еквивалентно на мрежа 192.168.*.* маска
        255.255.0.0. За да се използва метода е необходимо всички маршрутизиращи
        протоколи да пренасят информация освен за мрежовите адреси, така и за
        дължината на мрежовата част. При това става възможно да се адресират
        всички възможни IP адресни комбинации, премахва се разделянето на
        адресите на класове, премахва се понятието мрежова маска. В IPv6 мрежова
        маска не се дефинира като понятие, използва се единствено CIDR запис.
      </p>
      <h3>Частни адресни пространства</h3>
      <>
        Стандартът RFC 1819 определя следните групи IP адреси за устройства
        включени в локална мрежа:
        <center>
          <img style={{ width: '32rem' }} src={table5}></img>
        </center>
        При конфигуриране на устройствата в една локална мрежа се препоръчва
        използването на тези IP адреси, за да не се влиза в конфликт с адресите
        на устройствата включени в глобалната мрежа Интернет. Адресите от тези
        групи не се използват в Интернет.
      </>
      <h3>Служебни адресни пространства</h3>
      <ul style={{ listStyle: 'inside' }}>
        Служебните IP адреси не са адреси на устройства включени в мрежата. Те
        са резервирани за следните цели:
        <li>
          мрежови адреси. Представляват съвкупност от адреса на мрежата и нули
          за адреса на устройството.
        </li>
        <center>
          <img style={{ width: '32rem' }} src={table6}></img>
        </center>
        <li>
          broadcast адреси. Включват адреса на мрежата и единици за адреса на
          устройството.
        </li>
        <center>
          <img style={{ width: '32rem' }} src={table7}></img>
        </center>
        IP адресът 255.255.255.255 е запазен като limited broadcast address.
        Използва се, когато устройството не знае мрежовия адрес. Обикновено
        маршрутизаторите са програмирани така, че да не пропускат този адрес
        извън мрежовия сегмент.
        <li>
          мрежовият адрес 127 е резервиран за loopback функции. Единственият IP
          адрес в този мрежови сегмент е ‘127.0.0.1’.
        </li>
        <li>
          IP адресът 0.0.0.0 е запазен за обозначаване на компютър, който все
          още не е получил IP адрес.
        </li>
      </ul>
      <h3>Подмрежово маскиране</h3>
      <p>
        Ефективното използване на ограничения брой IP адреси в IPv4 налага да се
        използват мрежови маски, различни от подразбиращите се за класа мрежа.
        При използване на подмрежово маскиране частта от IP адреса за адрес на
        устройство се разделя на част за подмрежа и част за устройствата. На
        таблицата е показана мрежовата маска по подразбиране (default subnet
        mask) за мрежа клас B. Намалявайки частта за устройството с 8 бита се
        създава подмрежова част от адреса. Комбинацията от мрежовата и
        подмрежовата част се наричат разширен мрежов префикс (представка).
      </p>
      <center>
        <img style={{ width: '32rem' }} src={table8}></img>
      </center>
      <p>
        При добавяне на битове към мрежовата маска, диапазонът с адреси се
        разделя на няколко по-малки диапазона. Броят на хостовете в подмрежа е
        степен на числото 2 (2, 4, 8, ...). Ако използваме цял октет от IP
        адреса за подмрежа (8 бита), би трябвало да можем да създадем 256
        подмрежи. Това обикновено не е така, защото не всички комбинации са
        допустими. IP адресите с комбинацията от битове ‘1’ в мрежовата и
        подмрежовата част се използват за broadcast, а адресите със стойност на
        битовете’0’ – за мрежови адреси. Така, при N бита за подмрежова маска,
        броят на подмрежите е (2<sup>n</sup>- 2).
      </p>
    </div>
  );
}

export default Ip;
