import React from 'react';

function Lan() {
  return (
    <div>
      <h1>Категоризиране на мрежите според физическия обхват</h1>
      <ul style={{ listStyle: 'inside' }}>
        Физическият обхват включва географската област, която се заема от
        мрежата. Според физическия обхват съществуват следните категории мрежи:
        <li> Локална мрежа (LAN);</li>
        <li> Градска мрежа (MAN);</li>
        <li> Глобална мрежа (WAN);</li>
        Това разделение на мрежите е свързано и с техния размер. Локалните мрежи
        например, които имат най-малък физически обхват, съответно са и с
        най-малък брой включени компютри и потребители в мрежата.
      </ul>
      <h2>LAN мрежа</h2>
      <p>
        При локалните мрежи (LAN – Local Area Network) компютрите обикновено са
        разположени на близки разстояния. Те могат да бъдат в една стая, съседни
        стаи на един етаж, на няколко етажа или дори в съседни сгради. Броят на
        компютрите включени в мрежата може да варира значително. Може да
        съществува локална мрежа от два компютъра, десетки или дори стотици
        компютри.
        <br /> Големите локални мрежи могат да бъдат разделени на групи с цел
        по-лесното им управление. Една работна група ще може да споделя едни
        общи ресурси като файлове, принтери, приложения и др.
      </p>
      <ul style={{ listStyle: 'inside' }}>
        Чрез локалната мрежа се осъществява:
        <li>
          Достъп до съхранена информация на друг компютър – всеки потребител
          може да получи достъп до файловете на друг компютър в зависимост от
          зададените му права (пълен достъп, само за четене и др.). Ресурсите,
          които могат да се ползват и от други потребители в мрежата като
           устройства, директориите или само отделни файлове  се наричат
          споделени.
        </li>
        <li>Лесно прехвърляне на информация между компютрите.</li>
        <li>Съвместно използване на принтер в локалната мрежа.</li>
        <li>
          Свързване на приложения, които са инсталирани на различни компютри в
          мрежата – програма, която работи на един компютър, би могла да
          използва помощни програми, които са инсталирани на друг компютър.
          Наричат се Клиент-Сървър приложения.
        </li>
        <li>
          Автоматично обновяване на файлове в цялата мрежа – повечето от
          мрежовия софтуер предоставя възможност някои от файловете след
          обработка да бъдат обновени на всички компютри, където има техни
          копия.
        </li>
      </ul>
      <center>
        <img
          style={{ width: '32rem' }}
          src="https://previews.123rf.com/images/ohmega1982/ohmega19821311/ohmega1982131100290/23986480-réseau-lan-schéma-illustrator-pour-les-affaires-et-la-technologie-concept.jpg"
          alt=""
        ></img>
      </center>
      <h2>MAN мрежа</h2>
      <p>
        Градската мрежа (MAN – Metropolitan Area Network) се състои от няколко
        локални мрежи свързани помежду си в границите на един град.
        <b /> Терминът MAN обикновено се използва по-рядко при дефинирането на
        мрежи, отколкото термините LAN и WAN, защото градските мрежи се
        реализират много по-рядко. Повечето мрежи са в рамките на сграда или
        съседни сгради – съответно те се класифицират като LAN или обхващат
        по-големи територии – няколко града, различни държави – тогава ги
        класифицираме като WAN. Максималното разстояние, което покрива една
        градска мрежа е до 80 км.
      </p>
      <center>
        <img
          style={{ width: '32rem' }}
          src="https://www.conceptdraw.com/How-To-Guide/picture/metropolitan-area-networks.png"
        ></img>
      </center>
      <h2>WAN мрежа</h2>
      <p>
        Глобалната мрежа (WAN – Wide Area Network) обхваща голяма географска
        област. Компютрите включени в мрежата могат да бъдат в различни градове
        или различни държави. Най-голямата глобална мрежа е Интернет (Internet –
        International Network). Глобалната мрежа може да бъде и частна
        собственост. Например организация с офиси в различни градове или държави
        може да свърже своите компютри в мрежа посредством телефонни линии,
        сателити или други технологии.
        <br />
        Глобалната мрежа най-често се състои от множество свързани помежду си
        локални мрежи. За връзка между тях обикновено се използват обществени
        среди за пренос на информация, например обществената телефонна система.
        <br />
        От гледна точка на начина на управление, WAN мрежите се разделят на
        разпределени и централизирани. Разпределените WAN, например Интернет,
        нямат централизирано управление.
        <br />
        Връзките между локалните мрежи в рамките на глобалната мрежа се
        осъществяват с помощта на шлюз (gateway). Шлюзът представлява
        маршрутизатор, който определя пакетите с информация по кой път да
        преминат, за да достигнат до местоназначението си.
        <br />
        Частните глобални мрежи се изграждат с технологии – хардуерни и
        софтуерни – предназначени и използвани в глобалната мрежа Интернет.
        Затова те се наричат интранет-мрежи. Интранет мрежите използват за
        преносна среда собствени кабелни или безжични трасета на връзка или
        наемат такива от телекомуникационна компания. Значително по-евтино е при
        изграждането на частна мрежа да се използва Интернет като преносна
        среда. Прилагат се VPN (Virtual Private Networks) технологии, които
        гарантират висока сигурност и изолират частната мрежа от публичната чрез
        криптиране на обменяните данни. Такива мрежи е прието да се наричат
        екстранет.
      </p>
      <center>
        <img
          style={{ width: '32rem' }}
          src="https://media.router-switch.com/media/wysiwyg/Help-Center-FAQ/Router/wan.jpg"
        ></img>
      </center>
    </div>
  );
}

export default Lan;
