import React from 'react';

function NetworkP() {
  return (
    <div>
      <h1>Мрежови протоколи</h1>
      <h2>Как работят протоколите?</h2>
      <ul style={{ listStyle: 'inside' }}>
        При изпращащия компютър протоколът прави следното:
        <li>Разделя данните на малки части, наречени пакети;</li>
        <li>Добавя адресна информация към всеки пакет;</li>
        <li>Подготвя данните за реално предаване през мрежовия кабел.</li>
        <h3>
          При получаващия компютър протоколът извършва същите серии от стъпки в
          обратен ред:
        </h3>
        <li>Получава пакетите данни от кабела в мрежовата адаптерна карта;</li>
        <li>Отделя от пакетите служебната информация;</li>
        <li>
          <h3>
            Копира данните от пакетите в буфер, за да ги сглоби в първоначалния
            им вид;
          </h3>
        </li>
        <li>
          Подава сглобените данни в използваем вид към съответното приложение.
        </li>
        <h3>Съществуват:</h3>
        <li>
          немаршрутизируеми протоколи – за предаване на данни в една локална
          мрежа;
        </li>
        <li>
          маршрутизируеми протоколи – използват се за предаване на данните от
          една локална мрежа към друга по един от няколко възможни пътя
          (маршрута).
        </li>
        <h3>Протоколите се разделят на следните три групи:</h3>
        <li>
          Приложни – осигуряват обмена на данни и взаимодействието приложение-
          приложение (SMTP, FTP, Telnet, HTTP и др.);
        </li>
        <li>
          Транспортни – отговарят за надеждността при придвижване на данните в
          мрежата (TCP, NetBEUI);
        </li>
        <li>
          Мрежови – осигуряват така наречените свързващи услуги. Управляват
          адресиращата и маршрутизираща информация, осъществяват проверките за
          грешки и заявките за повторно предаване (IP).
        </li>
      </ul>
      <h2>NetBIOS</h2>
      <p>
        Протоколът NetBIOS (Network Basic Input/Output System) е създаден през
        90-те години на миналия век от IBM. NetBIOS има два режима на
        комуникация – сесиен и дейтаграмен режим. В сесиен режим NetBIOS
        позволява да се осъществи връзка (сесия) с откриване на грешки и
        възстановяване. В дейтаграмен режим съобщенията се изпращат без
        установяване на връзка. Откриването на грешки и коригирането им е задача
        на приложението.
        <br />
        NetBIOS осигурява услуга за именуване на хостовете. Адресацията става по
        име на компютър като компютрите са обединени в работни групи.
      </p>
      <h2>NetBIOS Over TCP</h2>
      <p>
        Няколко години по-късно е създаден друг протокол на базата на NetBIOS,
        който работи в TCP/IP мрежи – NetBIOS Over TCP. Използва се за споделяне
        на файлове и принтери в TCP/IP мрежите.
      </p>
      <h2>NetBEUI</h2>
      <p>
        Малки локални мрежи могат да се конфигурират чрез протокола NetBEUI
        (NetBIOS extended User Interface). NetBEUI използва протоколите NetBIOS.
        При NetBEUI протоколът няма възможност за маршрутизиране на информацията
        т.е може да се използва само в локална мрежа. <br />
        Протоколът NetBEUI е сравнително прост протокол и лесен за
        конфигуриране. Той е по-бърз от TCP/IP протокола.
      </p>
      <h2>TCP/IP</h2>
      <p>
        TCP/IP (Transmission Control Protocol/Internet Protocol) е основен
        протокол в глобалната мрежа Интернет. TCP/IP е сложен протокол, който се
        състои от други протоколи. Първият и най-важен от тях е IP (Internet
        Protocol).
        <br />
        <b>IP протоколът</b> използва технология за обмен на информация,
        наречена комутация на пакети. При комутация на пакетите, данните от едно
        съобщение, изпратено от един компютър към друг се разделят на пакети.
        Всеки пакет съдържа част от съобщението и служебна информация, като
        адрес на компютъра-получател, адрес на компютъра, който изпраща
        съобщението. Отделните пакети се изпращат в мрежата. В зависимост от
        натоварването на мрежата, пътят на пакетите, може да бъде различен. При
        предвижването си пакетите се насочват от маршрутизатори. Когато всички
        пакети пристигнат в компютъра-получател, служебната информация се
        отстранява и се получава оригиналното съобщение.
        <br />
        Използват се две версии на IP протокола – IPv4 и IPv6. IPv4 използва 32
        битови интернет адреси, а IPv6 – 128 битови. Съответно структурата на
        пакетите е различна.
        <br />
        IPv4 адресът се изписва като последователност от четири десетични числа,
        разделени с точка. Първото число е най-старшия октет (байт), следващите
        са младшите байтове.
        <br />
        IPv6 адресът се изписва като последователност от осем шестнадесетични
        числа, разделени с двоеточие. Ако в адреса има няколко последователни
        нули, те могат да се пропуснат като се изписват две двоеточия
      </p>
      <h3>TCP</h3>
      <p>
        е основния транспортен протокол, включен в пакета TCP/IP. Осигурява
        високо ниво на надеждност при предаване на данните. При него се
        гарантира, че всяко изпратено съобщение ще бъде получено. В TCP се следи
        за изгубени, повторно изпратени, не поредно получени и т.н. пакети. За
        това и този протокол е по-бавен.
      </p>
      <h3>UDP</h3>
      <p>
        е другият транспортен протокол. Той е сравнително прост протокол – не се
        занимава с установяване на последователност на пакетите, с
        препредаването им при грешка. При него не се гарантира достигането на
        съобщението до получателя. В структурата на пакетите, предавани чрез UDP
        се съдържа контролна сума. Чрез нея получателят на пакетите може да
        провери достоверността на информацията. Подходящ е за: кратки съобщения,
        които могат да се предадат в един пакет, за приложения работещи в реално
        време като VoIP (разговори по интернет), поточно аудио и видео.
      </p>
      <ul style={{ listStyle: 'inside' }}>
        Протоколът TCP/IP е най- използван от всички мрежови протоколи. Това е
        така поради следните причини:
        <li>
          TCP/IP работи с логически IP адреси като използва гъвкава схема за
          адресиране. При него има възможност за маршрутизиране на пакетите от
          информация, така че те да преминат по най-късия маршрут до
          местоназначението си.
        </li>
        <li>
          Почти всички операционни системи могат да използват протокола TCP/IP.
        </li>
        <li>Съществуват помощни програми, които работят с този протокол.</li>
        <li>
          Това е протоколът на глобалната мрежа Интернет. Всеки компютър, който
          се свързва към Интернет работи с този протокол.
        </li>
      </ul>

      <h2>IPX/SPX</h2>
      <p>
        IPX/SPX (Internet Package Exchange/Sequenced Packet Exchange) е
        мрежовият протокол на фирмата Novell. Той е задължителен при NetWare
        мрежите. Може да работи и на мрежа на Microsoft. Фирмата е създала
        собствена реализация на IPX/SPX съвместими протоколи, която се нарича
        NWLink. Протоколът IPX/SPX изисква минимално конфигуриране. От
        съображения за сигурност може да се използва на вътрешни мрежи на
        Microsoft, свързани към Интернет.
      </p>
      <h2>Apple Talk</h2>
      <ul style={{ listStyle: 'inside' }}>
        Apple Talk е съвкупност от протоколи на фирмата Apple за организиране на
        мрежи с компютри на Macintosh. Комплектът включва следните протоколи:
        <li>
          <b>LocalTalk</b> - използва се при свързване на компютри на Macintosh
          в малки локални групи;
        </li>
        <li>
          <b>EtherTalk</b> - за свързване на Macintosh групи към Ethernet мрежи;
        </li>
        <li>
          <b>TokenTalk</b> - за свързване на Macintosh групи към Token Ring
          мрежи;
        </li>
      </ul>
      <h2>Протоколи включени в OSI модела</h2>
      <p>
        OSI (Open System Interconnect) или Комуникация между отворени системи е
        мрежови модел включващ 7 слоя. При този модел правилата за
        взаимодействие между едноименните слоеве се обозначават чрез протоколи.
        Всеки слой използва конкретен протокол за управление на дадена функция.
        OSI моделът е създаден като алтернатива на TCP/IP модела.
      </p>
    </div>
  );
}

export default NetworkP;
