import React from 'react';

function NetworkModels() {
  return (
    <div>
      <h1>Мрежови модели</h1>
      <h2>Моделът OSI</h2>
      <p>
        Мрежовият модел OSI (Open System Interconnect) е абстрактен модел, който
        описва начина на комуникация в компютърните мрежи. Разработен е от
        Международната организация по стандартизация (ISO). OSI моделът
        позволява на различни системи да комуникират безпроблемно помежду си.
        Той е стандарт, който производителите на мрежово оборудване използват
        при проектиране на хардуер, операционни системи и протоколи.
        <br />
        Моделът се използва, само когато се пакетират данни за предаване на
        данни по мрежата, и не се използва, когато се осъществява локален достъп
        до данните на собствената компютърна система.
      </p>
      <h3>Структура на OSI модела</h3>
      <center>
        <p>
          Той включва 7 слоя, всеки от които е една стъпка в процеса на
          комуникация.
        </p>
        <img
          style={{ width: '32rem' }}
          src="https://lh4.googleusercontent.com/-AA4laRNDtY0/TW9kwG7cmSI/AAAAAAAAAZw/1NvFsS7uhNA/s1600/OSI_model.jpg"
        ></img>
      </center>
      <p>
        Всеки слой има точно определени функции – предоставя интерфейс и услуги
        към горния си слой, като също така получава услуги от слоя под него.
        Преди да се изпратят данните по мрежата те преминават последователно
        през отделните слоеве, като всеки слой добавя своя собствена информация
        към оригиналната информация. Информацията по мрежата се предава във вид
        на пакети. При достигане на получаващия компютър, пакетите преминават
        през отделните слоеве по възходящ ред като всеки слой отстранява
        допълнителната информация добавена от едноименния слой при изпращането
        й. По този начин след преминаване през всички слоеве информацията трябва
        да бъде сглобена, така че да се получи оригиналното съобщение.
      </p>
      <h3>Приложен слой</h3>
      <p>
        Слой 7 или Приложен слой е най-горният слой в модела. Той служи като
        посредник между софтуерните приложения и мрежовите услуги. В този слой
        работят протоколите HTTP, FTP, Telnet, SMTP, POP3, IMAP4, SNMP.
        <br />
        <b>
          Задачата на слоя е да управлява общия мрежов достъп, контрола на
          потоците от данни и поправката на грешки.
        </b>
      </p>
      <h3>Представителен слой</h3>
      <p>
        Слой 6 или Представителен слой определя използвания формат за обмен на
        данните. Тук получените от приложния слой данни се представят във вид на
        пакети („универсален” формат за пренос). При получателя става обратно
        преобразуване на данните от „универсален" във формат, използван от
        приложния слой на получаващия компютър.
      </p>
      <ul style={{ listStyle: 'inside' }}>
        <b>Този слой отговаря за преобразуването на данните:</b>
        <li>компресиране – намаляване на техния размер;</li>
        <li>криптиране – кодиране с цел защита от неоторизиран достъп;</li>
        <li>
          транслация на протоколи – с цел пренасяне между различни хардуерни
          платформи и операционни системи.
        </li>
        Тук работи софтуерът за споделяне на файлове и принтери – редиректор
        (redirector). Той определя дали заявка за вход/изход до файл се
        обработва от локалния компютър или от мрежово устройство чрез
        пренасочване на заявките.
      </ul>
      <h3>Сесиен слой</h3>
      <p>
        Слой 5 или Сесиен слой отговаря за изграждане на канал за връзка – сесия
        – между два компютъра в мрежата. Подобно на телефонен разговор, в
        сесията програмите „разговарят” помежду си. Сесиите могат да бъдат в
        режим на пълен дуплекс (full duplex) или полу-дуплекс (half duplex). И
        двата режима позволяват двупосочна комуникация. В режим на пълен дуплекс
        двете страни могат да изпращат и получават данни едновременно, а при
        полу-дуплекс – последователно.
      </p>
      <ul style={{ listStyle: 'inside' }}>
        Протоколите от сесийния слой включват:
        <li>
          Network Basic Input/Output System (NetBIOS) интерфейс – позволява
          компютрите от мрежата да осъществяват двупосочна връзка, обработка на
          големи съобщения, откриване на грешки и тяхното коригиране;
        </li>
        <li>
          Berkeley UNIX sockets (Sockets) интерфейс – базов приложен интерфейс
          (API) за използване на TCP/IP. Част от операционните системи
          UNIX/Linux, позволяват изграждането на TCP и UDP връзки.
        </li>
        <li>
          Windows Sockets (Winsock) – версията на Socket за Microsoft Windows.
          Освен базовите функции включва разширение, позволяващо по-строг
          контрол на връзките.
        </li>
      </ul>
      <h3>Транспортен слой</h3>
      <p>
        Слой 4 или Транспортен слой отговаря за транспортирането на пакетите с
        данни без грешки, в точна последователност и без загуби. Той може да
        оптимизира трафика чрез обединяване на непълни съседни пакети. При
        получаващия компютър транспортният слой разопакова пакетите и ги
        подрежда в първоначалния им вид, след което изпраща потвърждение за
        получаването им.
        <br />
        <b>
          Този слой осигурява контрол на потока и обработката на грешки при
          преноса на пакетите.
        </b>
        <br />
        Tранспортните протоколи TCP, UDP от TCP/IP и услугата за преобразуване
        на имена – Domain Name System (DNS) работят в този слой.
      </p>
      <h3>Мрежови слой</h3>
      <p>
        Слой 3 или Мрежов слой отговаря за адресирането на съобщенията и за
        определянето на маршрут, по който да преминат данните от компютъра –
        източник до компютъра – получател. Слоят следи и за проблеми при
        трафика. Също така управлява приоритета на данните – Quality of Service
        (QoS) – гарантиране на мрежов ресурс (пропускателна способност) за
        интерактивни приложения като аудио и видео разговори. <br />
        Протоколът IP от TCP/IP работи в този слой. Тук работят
        маршрутизаторите.
      </p>
      <h3>Канален слой</h3>
      <p>
        Слой 2 или Канален слой изпраща кадрите с данни от мрежовия слой към
        физическия слой.
      </p>
      <ul>
        Той включва два подслоя:
        <li>
          Контрол за достъп до преносната среда – Media Access Control (MAC);
        </li>
        <li>Контрол на логическите връзки – Logical Link Control (LLC);</li>
      </ul>
      <p>
        MAC подслоят разпределя достъпа на компютрите до физическата преносна
        среда. Той дефинира MAC адресите.
        <br />В LLC подслоя се дефинира логическата топология. Тя може да не
        съвпада с физическата.
        <br />В каналния слой работят устройствата мост и суич.
      </p>
      <center>
        <img
          src="http://pgds.org/books/km/11_files/image001.gif"
          style={{ width: '34rem' }}
        ></img>
        <ul>
          Данните пътуват по мрежата във вид на фреймове (frames). Всеки фрейм
          (кадър) се състои от няколко елемента:
          <li>
            <b>Идентификатор на получателя (Destination ID)</b> – адресът на
            компютъра, към който се изпращат данните;
          </li>
          <li>
            <b>Идентификатор на подателя (Sender ID)</b> – адресът на компютъра,
            изпращащ данните;
          </li>
          <li>
            <b>Контролна информация</b> – определя типа на фрейма, маршрута и
            сегментирането;
          </li>
          <li>
            <b>Пакет данни</b> – същинската информация, предавана по мрежата;
          </li>
          <li>
            <b>
              Циклична проверка на контролната сума (Cyclical Redundancy Checks
              – CRC)
            </b>
            – информация за проверка и корекция на грешките.
          </li>
          След изпращането на всеки фрейм обратно се изпраща потвърждение за
          пристигането му. Фреймовете, за които не се получи потвърждение или са
          повредени, се изпращат повторно.
        </ul>
      </center>
      <h3>Физически слой</h3>
      <p>
        Слой 1 или Физически слой предава потока от битове (единици и нули) от
        мрежовата карта към преносната среда. Битовете са кодирани като
        електрически или светлинни импулси (при безжичните системи са
        електромагнитни вълни). Този слой определя типа на връзката между
        мрежовата карта и кабела, както и техниката на предаване на информацията
        по мрежата.
        <br />
        Устройствата, които работят на това ниво са мрежови карти, повторители,
        хъбове, медиа конвертори.
      </p>
      <h2>Моделът DoD</h2>
      <p>
        Моделът е създаден от Министерството на отбраната на САЩ – Department of
        Defense (DoD) – през 70-те години на миналия век (около 10 години преди
        OSI модела). Този модел е разработен съвместно с TCP/IP – част от
        проекта ARPAnet. Протоколите на TCP/IP са проектирани в този модел.
        Затова и този модел е известен с наименованието TCP/IP модел.
      </p>
      <ul>
        Състои се от четири слоя:
        <li>
          <b>Слой 4</b> - Приложен (application layer) - най-горният слой от
          модела. Обхваща функциите на трите най-горни слоя на OSI модела;
        </li>
        <li>
          <b>Слой 3</b> - Транспортен (хост до хост) (host to host (transport)
          layer) – съответства на транспортния слой на OSI модела. Тук работят
          TCP, UDP, DNS;
        </li>
        <li>
          <b>Слой 2</b> - Слой интер-мрежа (internetworking layer) – съответства
          на мрежовия слой на OSI. Занимава се с маршрутизацията основана на
          логическите IP адреси. Протоколът Address Resolution Protocol (ARP)
          преобразува логическите IP адреси в MAC адреси;
        </li>
        <li>
          <b>Слой 1</b> - Мрежов интерфейс (network interface layer) –
          съответства на двата слоя – канален и физически на модела OSI. Тук
          работят Ethernet и Token Ring протоколите. В този слой се използват
          само MAC адреси.
        </li>
      </ul>
      <center>
        <img
          style={{ width: '32rem' }}
          src="https://miro.medium.com/max/914/1*sceR29M-tWNS1g7TRUJScA.png"
        ></img>
      </center>
    </div>
  );
}

export default NetworkModels;
