import React from 'react';

function Protect() {
  return (
    <div>
      <h1>Защита и възстановяване от сривове</h1>
      <h2>Аварийно захранване</h2>
      <p>
        Гръмотевичните бури и пренапреженията, които могат да възникнат в
        електрическата мрежа могат да доведат не само до загуба на данни, но и
        до повреди в хардуера. Най-евтиният начин за предпазване от
        пренапрежения е чрез поставяне на предпазител от пренапрежение.
        <br />
        Предпазителят от пренапрежение е защитно устройство, което ограничава
        повишаванията на напрежението. Желателно е всеки компютър в мрежата да
        бъде снабден с такова устройство. Той предпазва от възникващите
        пренапрежения, но не осигурява енергоподаване при спиране на
        захранването.
        <br />
        По-добрият вариант е използването на непрекъсваемо устройство – UPS
        (Uninterruptible power supply). UPS е автоматизирано външно захранващо
        устройство, което осигурява електроенергия за компютрите и други
        устройства, когато основното електрозахранване спре.
        <br />
        UPS устройството се поставя между компютърната система и основния
        източник на електроенергия. Чрез един UPS обикновено могат да се
        захранят няколко компютъра или други устройства. При изключване на
        основното електрозахранване UPS уведомява потребителите в мрежата (напр.
        чрез звуков сигнал) за възникналия проблем. Потребителите имат
        възможност да съхранят данните, с които са работили и да изключат
        безопасно системата.
        <br />
        Smart UPS системите работят в режим он-лайн. Те генерират непрекъснато
        синусоидално 220V 50Hz напрежение, като едновременно черпят и зареждат
        акумулаторите си. Те осигуряват галванична развързаност от захранващата
        мрежа. При пренапрежение UPS системите пропускат само част от пиковото
        напрежение, обикновено с коефициент на затихване 1/1000 или 1/2000.
        <br />
        Back UPS системите работят в режим stand-by. При наличие на захранване,
        те осигуряват директна връзка на консуматорите към захранващата мрежа.
        Когато се прекъсне електрозахранването UPS автоматично го замества.
      </p>
      <ul>
        При избор на UPS трябва да се съобразим със следните въпроси:
        <li>
          Колко системи, с каква обща мощност ще трябва да захранва UPS
          устройството?
        </li>
        <li>
          Предлага ли се софтуер, осигуряващ възможност за уведомяване на
          потребителите и мрежовия администратор при прекъсване на захранването?
          Позволява ли софтуера безопасно изключване на захранваните системи?
        </li>
        <li>
          За колко системи е защитата за безопасно изключване? Ако са включени
          няколко компютъра към UPS, поддържа ли се изключване на всички
          компютри?
        </li>
        <li>Ефективна ли е защитата срещу токови удари?</li>
        <li>
          Има ли допълнителна защита за пренапрежения към мрежовата карта?
        </li>
        <li>Каква е продължителността на живот на батерията?</li>
      </ul>
      <p>
        Мощността на UPS се измерва във волт-ампери (VA, пълна мощност).
        Мощността на консуматорите се измерва във ватове (W, активна мощност).
        Електрическите товари потребяват както активна, така и реактивна
        енергия. За изчисляване на необходимата пълна мощност на UPS система,
        захранваща компютърни системи се използва коефициент на мощността.
        Представлява отношение на активната мощност (W) към реактивната мощност
        (VA), потребявана от товара. За компютърни системи с импулсен захранващ
        блок този коефициент е над 0.7 . Как да се определи необходимата мощност
        на UPS? Например, ако мощността на UPS устройството е 1000VA, при
        коефициент 0.7 той може да захранва консуматори с мощност до 700W.
        По-правилно е при избор на UPS да се остави резерв на мощността и за
        коефициента да се избере стойност 0.6, така 1000VA UPS може да захрани
        консуматори с мощност до 600W. UPS защитават компютрите и данните в тях
        при отпадане на захранването, но те не осигуряват възможност за
        продължително захранване. За целта непрекъсваемите захранващи системи
        могат да се комбинират с генератор на напрежение.
      </p>
      <h2>Архивиране на данните</h2>
      <ol>
        Независимо от положените усилия за защита на данните, винаги съществува
        възможност за тяхната загуба. Причините за загуба на данни са
        многобройни. Ето най-честите от тях:
        <li> Повреда на твърдия диск</li>
        <li>Повреда на инсталацията на операционната система</li>
        <li>Изгубване, изтриване</li>
        <li>Вирусна атака</li>
        <li>Кражба</li>
        <li>Природни бедствия</li>
      </ol>
      <h2>Отказоустойчивост</h2>
      <p>
        Системите за отказоустойчивост предпазват данните от загуба чрез
        дублиране на самата хардуерна система. Например, много важни сървъри
        притежават по два захранващи блока, при авария на един от захранващите
        блокове, системата продължава своята работа като алармира системния
        администратор. Важна особеност на системите за отказоустойчивост е
        възможността за замяна без изключване на системата (hot spare). Така,
        авариралият захранващ блок може да бъде демонтиран и сменен с изправен
        без изключване електрозахранването на компютърната система. <br />В
        особено важни системи, например с космическо и военно предназначение се
        прави тройно дублиране на управляващите системи. Всяка управляваща
        система получава информация от наличните датчици и взема решения за
        промяна на траекторията, промяна на работната среда и др. При
        тройно-дублираните системи се приема за вярно това решение, което се
        взема от две от трите управляващи системи, когато другата система е
        повредена. <br />
        Съвременните операционни системи поддържат функция за горещо поправяне
        (hot fixing) на повредени дискови данни. При откриване на грешен сектор
        от диска, драйверът на отказоустойчивостта се опитва да премести данните
        в добър сектор и да отбележи повредения като лош – забранен за
        използване. Защо е възможно това? Ако секторът е физически повреден, той
        не може да се прочете, данните се губят и не е възможно да се
        възстановят. На практика дисковете се повреждат постепенно. Части от
        покритието на диска с по-лошо качество губят възможностите си за
        четене-запис. При това прочитането е възможно след няколко поредни
        опита. Входно-изходният драйвер проверява колко опита за четене са
        направени, ако е премината зададената граница, определя сектора като
        повреден и премества успешно прочетения сектор. Възможно е драйверът да
        извършва контролно четене на записаната информация, за да установи
        повреда на сектора. Това е известно като Read-After-Write и се използва
        при оптическите системи за съхраняване на информация. При твърдите
        дискове не се използва, тъй като ще доведе до голямо натоварване на
        дисковата система и забавяне на нейната работа.
        <br /> Най-често се използват системи за отказоустойчивост на данните
        реализирани чрез RAID технология за защита на данните, съхранявани на
        твърди дискове. За да има устойчивост, системата трябва да е
        преосигурена, да има излишък, дублиране на информацията (redundancy).
        Създават се надеждни масиви от нескъпи дискове RAID (Redundant Array of
        Independent/Inexpensive Disks). Съществуват различни нива на RAID, с
        различни възможности.
      </p>
      <p>
        <b>RAID 0 – Лентов набор (Disk Stripping)</b>
        Съдържанието на дисковете се разглежда като блокове (клъстери) с размер
        64KB. Данните се разполагат последователно във всички дискове от масива.
        Тъй като няма излишък на данните, няма никаква отказоустойчивост.
        Обратно, вероятността за дефект на системата се увеличава, при отказ на
        един от дисковете в масива се губи цялата информация. Тогава защо се
        използват лентовите набори:
        <br />
        1) Те позволяват създаване на голям обем дисков масив чрез обединяване
        на множество дискове (за Windows сървърите до 32).
        <br />
        2) Увеличава се бързодействието на дисковата система в сравнение с
        бързодействието на всеки от твърдите дискове. Например, за система от
        два диска с лентов набор, времето за четене и запис е два пъти по-малко
        от това на отделния твърд диск, тъй като дисковете операции се
        разпределят по двете независими устройства.
        <b>RAID 1 – Огледални дискове (Disk Mirroring)</b>
        <br />
        За дублиране са необходими два твърди диска, препоръчително е те да са с
        еднаква големина (еднакъв брой LBA[1] блокове). Вторият диск съдържа
        точно (огледално) копие на първия диск. Първият диск е основен
        (primary), вторият е архивен (secondary). Ако един от дисковете се
        повреди системата продължава работа без прекъсване. RAID 1 се реализират
        чрез интегриран на дънната платка или външен (PCI, PCI-X) RAID
        контролер. Препоръчва се използване на дуплексиране – всеки твърд диск
        работи със собствен дисков контролер. Ако двата диска използват общ
        дисков контролер, то неговото авариране спира цялата система, въпреки
        дублирането на информацията. Най-често се използват два еднакви SATA
        твърди диска. „Гореща” замяна в този случай не е възможна. При RAID 1
        времето за четене е два пъти по-малко отколкото на твърдия диск, времето
        за запис е същото. При използване на големи области от последователни
        блокове от данни (големи файлове), четните блокове се намират на първия
        диск, нечетните – на втория. При четене половината информация се прочита
        от диск 1, другата половина от диск 2 – съответно времето за четене е
        два пъти по-малко. При запис информацията се записва едновременно на
        двата твърди диска, времето за запис е без промяна.
        <b>
          RAID 3 – Лентов набор с големи блокове (Disk Stripping with Large
          Blocks)
        </b>
        <br />
        Използват се големи блокове данни. Използва се отделен диск за проверка
        на данните. RAID 3 включва три твърди диска. Подобно на RAID 0
        информацията се разделя на блокове, които се записват последователно на
        първия и втория диск. В третия диск се записва блок данни, като всеки
        байт е изчислен като ИЗКЛЮЧВАЩО ИЛИ на данните от първия и втория диск.
        <b>
          RAID 5 – Лентов масив с контрол по четност (Stripping with Parity)
        </b>
        <br />
        Това е най-популярният RAID метод. Поддържат се минимум 3, максимум 32
        твърди диска. За разлика от RAID 3 няма отделен диск за корекция на
        грешки, коригиращата информацията се разпределя и записва на всеки от
        дисковете в масива. При повреда на едно устройство, на останалите има
        достатъчно служебна (коригираща) информация за възстановяване на
        съдържанието на повреденото устройство. Повреда на два диска води до
        загуба на данните в масива. RAID 5 обикновено се реализира с блок от
        дискове проектирани за замяна без изключване (hot spare).
        <b>RAID 10 – Огледални дискови масиви (Mirrored Disk Arrays)</b>
        <br />
        RAID 10 създава два идентични RAID 0 дискови масива. За всеки твърд диск
        от първия масив се създава огледален образ върху друг твърд диск от
        другия масив.
      </p>
    </div>
  );
}

export default Protect;
