import React from 'react';
import IpSyntax from '../../constants/pictures/ping.png';
import Arp from '../../constants/pictures/arp.png';
import Trace from '../../constants/pictures/trace.png';

function TcpIpHelpers() {
  return (
    <div>
      <h1>TCP/IP помощни програми</h1>
      <p>
        В операционната система Windows са включени няколко помощни програми за
        разглеждане на конфигурационната информация и отстраняване на проблеми.
        Тъй като те са наследство от операционната система UNIX, програмите
        представляват приложения, които се използват в команден прозорец. Такива
        приложения в Windows се наричат конзолни. За разлика от графичните
        приложения (GUI, Graphic User Interface), конзолните нямат собствена
        диалогова форма, а прост текстови интерфейс. Конзолните приложения не са
        DOS програми.
      </p>
      <center>
        За да стартирате команден режим на работа, въведете от Start/Run
        командата ‘cmd’. Ще се отвори следния екран:
        <br />
        <img src="http://pgds.org/books/km/18_files/image002.jpg"></img>
      </center>
      <ul style={{ listStyle: 'inside' }}>
        Ще разгледаме следните основни TCP/IP помощни програми:
        <li>ping – Packet Internet Grouper</li>
        <li>arp – Address Resolution Protocol</li>
        <li>netstat – Network Status</li>
        <li>nbtstat – NetBIOS Over TCP/IP Status</li>
        <li>
          ipconfig, ifconfig – Internet Protocol Configuration, Interface
          Configuration
        </li>
        <li>tracert, traceroute – Trace Route</li>
      </ul>

      <h2>Ping</h2>
      <p>
        Помощна програма за проверка на мрежовата свързаност – тестване на
        връзката с другите компютри. Използва протокола ICMP (Internet Control
        Message Protocol). Може да работи с въведен параметър име на хост или IP
        адрес. В мрежата се изпраща пакет до конкретен host или група host-ове.
        Всеки host (ако протокола ICMP не е забранен) връща пакет до изпращача.
        Визуализира се времето за изпращане и получаване на пакет. Ако пакетът
        не се ‘завърне’ до зададения тайм-аут (или е изгубен), се изписва
        съобщение „Request timed out”.
      </p>
      <center>
        <img style={{ width: '36rem' }} src={IpSyntax} alt="aaa"></img>
      </center>
      <p>
        Командата ping може да се използва за проверка на мрежовата карта:
        <br />
        <b>ping 127.0.0.1</b>
        <br />
        Ако проверката е успешна се изпращат четири пакета и се показва времето
        им за връщане. Ако се получи съобщение „Request timed out”, мрежовата
        карта не отговаря на заявките.
        <br />
        Командата ping може да се използва за проверка на мрежовата свързаност с
        хоста например на dir.bg или ако искаме да разберем IP адреса на този
        хост.
      </p>
      <h2>Arp</h2>
      <p>
        Използва се за визуализация и модификация на таблицата IP-към-Физически
        адрес. ARP протоколът (Address Resolution Protocol) извършва съпоставяне
        между логическите IP адреси и физическите (MAC) адреси.
        <br />
        Синтаксис:
      </p>
      <center>
        <img src={Arp} style={{ width: '32rem' }} />
      </center>
      <h2>Netstat</h2>
      <p>
        Показва информация за мрежовите сесии (активни връзки) на съответния
        компютър. Сесията е от порта на един хост до порта на друг хост. <br />
        <b>netstat</b> без параметри показва активните сесии
        <br />
        <b>netstat –a</b> показва всички сесии
        <br />
        Чрез netstat получаваме информация за използвания протокол, името на
        локалния компютър и използвания порт, името на другия компютър, с който
        има изградена сесия и състоянието на сесията.
      </p>
      <h2>nbtstat</h2>
      <p>
        Предоставя информация за имената на компютрите и групите, известни на
        конкретен компютър. За задаване на компютъра по IP адрес се използва
        параметър ‘–A’, за задаване на компютъра по име – параметър ‘–a’.
      </p>
      <h2>ipconfig</h2>
      <p>
        Предоставя информация за TCP/IP конфигурацията на всички мрежови карти,
        включени към компютъра. В UNIX/Linux системи командата се нарича
        ifconfig.
      </p>
      <ul style={{ listStyle: 'inside' }}>
        Тя извежда информация за:
        <li>IP адрес;</li>
        <li>подмрежова маска;</li>
        <li>Gateway – подразбиращ се шлюз.</li>
        Командата ipconfig /all предоставя допълнителна информация за мрежовите
        карти като:
        <li>физически MAC адрес;</li>
        <li>адреси на DNS сървъри;</li>
        <li>DHCP информация и др.</li>
      </ul>
      <h2>Traceart</h2>
      <p>
        Проследява маршрута през мрежата до компютъра – местоназначение по
        зададен IP адрес или име. Изпраща по три пакета до маршрутизатор и
        показва времето за връщане (* за загубени пакети). В UNIX/Linux системи
        командата се нарича traceroute. Изпраща ICMP пакети с TTL от 1 до
        зададения с параметър h брой пакети. Прави по три ‘пинга’ до рутер и
        показва времето за връщане. До първия рутер, поставя в ICMP пакета
        стойност 1, първият рутер го връща с отказ, отчита се времето. Увеличава
        се стойността на 2, пакетът преминава през първия рутер, достига до
        втория, връща се от него и т.н.
      </p>
      <center>
        <img style={{ width: '32rem' }} src={Trace} />
      </center>
    </div>
  );
}

export default TcpIpHelpers;
