import React from 'react';

function Topology() {
  return (
    <div>
      <h1>Категоризиране на мрежите по топология</h1>
      <h2>Топология тип „шина” (Bus)</h2>
      <p>
        При мрежата тип “шина” всички компютри се свързват последователно по
        протежението на кабел, наречен гръбнак.
        <br />
        Тъй като мрежата има начало и край, трябва да се добави терминатор в
        двата края на мрежата. Терминаторът предпазва линията от т.н. „отскачане
        на сигнала”. Ако липсва терминатор сигналът, достигайки до края на
        линията, отскача и се връща обратно, което пречи на останалите изпратени
        сигнали. Единият от краищата на шината трябва да бъде заземен (но не и
        двата!).
      </p>
      <h3>Комуникация</h3>
      <p>
        При тази топология всяка станция изпраща своите съобщения едновременно
        към всички останали станции. От всички съобщения по мрежата станцията
        избира и “хваща” само тези, които са предназначени за нея. Всички
        съобщения, които не са адресирани до съответната мрежова карта се
        игнорират. Само един компютър в даден момент може да изпраща информация.
        Всички останали „чакат” своя ред. Ако два компютъра се опитат да
        изпратят информация към шината едновременно, възниква конфликт –
        <b>колизия</b>.
        <b />
        Обикновено шинната топология се реализира чрез коаксиален кабел.
      </p>
      <center>
        <img
          style={{ width: '32rem' }}
          src="https://educatech.in/wp-content/uploads/2021/10/Bus-Topology.jpg"
        ></img>
      </center>
      <ul style={{ listStyle: 'inside' }}>
        <h3>Предимства</h3>
        <li>Лесна за инсталиране;</li>
        <li>Използва се по-малко кабел;</li>
        <li>Няма централна точка;</li>
        <li>
          Подходяща за малки мрежи, които свързват само няколко компютъра.
        </li>
        <h3>Недостатъци</h3>
        <li>Остаряла топология</li>
        <li>Един контур свързва всички компютри;</li>
        <li>
          Само един компютър може да предава информация по мрежата в даден
          момент от време. Информацията се разпръсква по кабела като само една
          мрежова карта я приема;
        </li>
        <li>
          Не е лесно да се добавят компютри в мрежата. Трябва да се прекъсне
          мрежовата връзка, за да се добави компютър;
        </li>
        <li>
          Ако един компютър причинява проблеми, всички компютри в мрежата са
          засегнати от неизправността му.
        </li>
      </ul>
      <h2>Топология тип “звезда” (Star)</h2>
      <p>
        Най-разпространеният тип мрежова структура днес е мрежата тип “звезда”.
        При топология звезда, всеки компютър се свързва чрез отделен кабел с
        централно устройство – хъб или суич. Кабелът, снабден от двата края с
        конектори се включва от едната страна към конектора на мрежовата карта и
        от другата страна към свободен порт на хъба. Всяка централна точка може
        да свърже 16 или 32 устройства. При по-голям брой компютри е възможно да
        се реализира т.н. каскадно свързване – няколко хъба се свързват помежду
        си. В случая не се налага използването на терминатори.
      </p>
      <center>
        <img
          src="https://savvytower.com/wp-content/uploads/2020/05/Star-Network-Topology.jpg"
          style={{ width: '32rem' }}
        ></img>
      </center>
      <h3>Комуникация</h3>
      <p>
        Комуникацията е различна, в зависимост от това дали централното
        устройство е хъб или суич. При хъба получената информация на един от
        портовете се усилва и препредава към всички портове т.е. изпраща се до
        всички устройства включени към хъба. При суича получената информация се
        изпраща само до компютъра – получател. При използване на хъб топологията
        е физическа „звезда”, логическа „шина”. (Виж Тема 3 – Мрежови устройства
        за свързване) Звездообразната топология се реализира чрез UTP кабел.
      </p>
      <ul style={{ listStyle: 'inside' }}>
        <h3>Предимства</h3>
        <li>
          Ако има проблем с един компютър в мрежата, останалите компютри
          продължават да работят, въпреки че няма да имат достъп до ресурсите на
          проблемния компютър;
        </li>
        <li>
          Могат да се добавят компютри към централната точка без да се спира
          работата на цялата мрежа.
        </li>
        <h3>Недостатъци</h3>
        <li>
          По-скъпа за реализация – всеки компютър трябва да се свърже с
          централната точка с отделен кабел и обикновено е необходим повече
          кабел, в сравнение с шинната и кръговата топологии;
        </li>
        <li>
          Необходимо е да се закупи допълнително устройство за свързване –
          концентратор (хъб) или комутатор (суич);
        </li>
        <li>
          Компютрите не могат да бъдат на повече от 90 метра (кабел) от
          централната точка.
        </li>
      </ul>
      <h2>Кръгова топология (Ring)</h2>
      <p>
        При мрежата тип “кръг” всички устройства са свързани помежду си така, че
        образуват един затворен кръг. Днес тези мрежи не са толкова популярни,
        колкото в миналото.
        <br />
        Ако последният компютър в една мрежа с шинна топология се свърже с
        първия компютър ще се получи мрежа с кръгова топология. Тук всеки
        компютър се свързва с два други компютъра. В този случай терминатори не
        са необходими.
      </p>
      <center>
        <img
          src="https://techprojournal.com/wp-content/uploads/2020/07/ring-topology.jpg"
          style={{ width: '32rem' }}
        ></img>
      </center>
      <h3>Комуникация</h3>
      <p>
        Информацията пътува само в една посока, така че когато се изпрати
        информация до определен компютър, тя трябва да премине през всеки
        компютър, който е преди получателя. Когато получи информация, компютърът
        проверява дали тя е за него. Ако не е, той я изпраща до следващия
        компютър и т.н. Това увеличава времето за предаване на информацията.
        <br />
        Кръгът се счита за активна топология – всеки компютър усилва сигнала
        преди да го предаде към следващия. Кръговата топология обикновено я
        свързваме с архитектурата Token Ring – използва се т.нар. „управляващ
        маркер”, като само станцията, която притежава маркера предава
        информацията. След приемането на информацията маркерът се получава в
        приемащата станция. Ако станцията няма нищо за предаване тя препредава
        маркера на следващата в кръга.
      </p>
      <ul style={{ listStyle: 'inside' }}>
        <h3>Предимства</h3>
        <li>Сравнително проста за инсталиране топология;</li>
        <li>По-малко кабели в сравнение с топология „звезда”;</li>
        <li>Няма централна точка;</li>
        <li>
          Няма начало или край на мрежата, така че няма нужда от терминатори.
        </li>
        <h3>Недостатъци</h3>
        <li>Повреда в кръга на мрежата засяга цялата мрежа.;</li>
        <li>
          Трудно е да се добавят нови компютри. Необходимо е да се прекара
          кабел, за да се добави компютър и цялата мрежа няма да работи, докато
          новата система не бъде инсталирана и включена.
        </li>
      </ul>
      <h3>Топология тип “пръстен”</h3>
      <p>
        В съвременните Token Ring мрежи се използва устройство подобно на
        концентратор, наречено MAU (multi-station access unit). Всеки компютър
        се включва към мрежата чрез конектор към MAU. Включването и изключването
        на компютър не пречи на останалите в мрежата. Топологията е физическа
        „звезда”, логически „кръг”, и е известна като топология тип „пръстен”.
      </p>
      <center>
        <img
          style={{ width: '32rem' }}
          src="http://lh3.ggpht.com/_NNjxeW9ewEc/TN5LVZaDhnI/AAAAAAAARyQ/vfbJ-s-wpqE/tmp6F3_thumb_thumb.jpg?imgmax=800"
        ></img>
      </center>
      <h3>Топология тип “двоен пръстен” (Dual-ring)</h3>
      <p>
        Мрежата се изгражда от два пръстена, като трафикът в пръстените се движи
        в противоположни посоки (counter-rotating). Пръстените са първични
        (primary) и вторични (secondary). При нормално функциониране на мрежата
        се използва първичният кръг, а вторият е свободен (idle). Вторият кръг
        осигурява надеждност, поема трансфера на данните при отпадане на
        първичния кръг. <br />
        FDDI (Fiber Distributed Data Interface) е технология за изграждане на
        градски мрежи (MAN) или големи локални мрежи. Използва се метод за
        достъп до канала ‘token passing’ и оптични кабели за пренос на данните.
        FDDI мрежите се изграждат по стандарта ANSI X3T9.5 определящ скорост за
        трансфер от 100Mbps, като съществуват спецификации на FDDI за скорости
        от 1Gbps и 10Gbps. Обикновено се използват многомодови оптически кабели,
        с максимална дължина 2000м. В пръстена може да има до 500 компютъра,
        което определя максимална дължина на кръга от 100км. Аналогично на Token
        Ring, FDDI е поделена мрежа, само един компютър (притежаващ маркера)
        може да предава в нея.
        <br />
        В зависимост от начина на включване, станциите в FDDI мрежата, се
        разделят на два вида - DAS (Dual Attachment Station) и SAS (Single
        Attachment Station). DAS са физически свързани и към двата кръга, а SAS
        участват единствено в първичния кръг.
        <br />
        SAS станциите не се включват към първичния кръг директно, а към
        концентратори, които са част и от двата кръга. Това не позволява срив на
        DAS да доведе до разпад на мрежата. При отпадане на една DAS станция
        мрежата се преконфигурира, данните се маршрутизират по част от вторичния
        кръг. При отпадане на две DAS станции се образуват два кръга, които
        продължават да функционират, но нямат връзка помежду си.
      </p>
      <h2>Хибридни мрежи</h2>
      <p>
        Има много вариации на основните топологии. Тъй като могат да се
        комбинират различни топологии в една и съща мрежа, хибридните мрежи са
        се появили като комбинация от поне два различни типа топологии. <br />
        Например: при създаване на MAN се използва FDDI като опорна мрежа, която
        свързва голям брой 100Mbps LAN мрежи. Това ще създаде мрежа тип двоен
        пръстен, с множество мрежи тип звезда, разклоняващи се от нея.
      </p>
    </div>
  );
}

export default Topology;
