import React from 'react';
import './HDD.css';

function HDD() {
  return (
    <div>
      <h1>Твърд диск</h1>
      <div>
        <h2>Дисковете имат следните характеристики</h2>
        <ul>
          <li>
            <h3>Скорост на предаване на данни</h3>
            <ol>
              <li>Вътрешна зона на диска: от 44,2 до 74,5 MB/s</li>
              <li>Външна зона на диска: от 74,0 до 111,4 MB/s</li>
            </ol>
          </li>
          <li>
            <h3>Интерфейс</h3>
            <p>
              - съвкупността от връзки, сигнали, технически средства за
              поддръжка на връзките и правила на обмен. Модерните твърди дискове
              ползват интерфейси ATA, Serial ATA, SCSI
            </p>
          </li>
          <li>
            <h3>Капацитет</h3>
            <p>
              - количество данни, които могат да се запишат. Модерните твърди
              дискове достигат капацитет 1000 Gb.
            </p>
          </li>
          <li>
            <h3>Физически размер (форм-фактор)</h3>
            <p>
              - почти всички съвременни дискове за персонални компютри и сървъри
              са с размер или 3,5, или 2,5 инча. Други разпространени формати са
              — 1,8, 1,3 и 0,85 инча
            </p>
          </li>
          <li>
            <h3>Скорост на въртене</h3>
            <p>
              - шпиндела (на английски: spindle speed) — брой обороти на
              шпиндела за минута. От нея зависят времето за достъп и скоростта
              на предаване на данните. Към 2007 се произвеждат твърди дискове
              със скорости на въртене: 4200, 5400 и 7200 (ноутбуци), 7200 и 10
              000 (персонални компютри), 10 000 и 15 000 об/мин.
            </p>
          </li>
          <li>
            <h3>Количество входно-изходни операции за секунда </h3>
            <p>
              - съвременните дискове позволяват около 50 оп./сек при произволен
              достъп и около 100 оп./сек при последователен достъп.
            </p>
          </li>
          <li>
            <h3>Консумация на енергия</h3>
            <p>- важен фактор при мобилните устройства.</p>
          </li>
          <li>
            <h3>Ниво на шум</h3>
            <p>
              - шумът при работа на диска, измерен в децибели. За да се счита за
              тих, дискът трябва да има ниво на шума около 26 dB и по-малко
            </p>
          </li>
        </ul>
      </div>
      <div className="info">
        <p>
          Твърдият диск (наричан още харддиск или само хард) е енергонезависима
          памет за компютри и други цифрови устройства. Информацията се
          съхранява по магнитен път върху покрити със специален слой плочи.
          Запаметяващото устройство използва набор от една или повече дискови
          плочи (диска) около обща ос в т.нар. дисков пакет.
          <br />
          Традиционно плочите са изработвани от алуминий, но с нарастване на
          плътността на запис се правят от стъкло. Всяка плоча е покрита с
          магнитен слой, върху който информацията се записва и чете от магнитна
          глава.
          <br />
          Данните се записват върху концентрични окръжности, които се наричат
          „пътечки“ (писти). Пистите се номерират за всяка плоча поотделно, като
          се започва от нулева (най-външната работна) до последната (с най-голям
          номер). Обикновено след нея има и няколко резервни (запасни). Целият
          дисков пакет се върти с постоянна ъглова скорост около оста си,
          задвижван от електродвигател.
          <br />
          При старите и големи устройства той е дори мощен трифазен
          електродвигател, свързан чрез ремъчна предавка с шпиндел, на който е
          фиксиран дисковия пакет. В съвременните устройства двигателят за
          пакета е най-често миниатюрен и плосък, куплиран директно към
          шпиндела, и управляван от специализиран контролер, стабилизиращ
          скоростта му на въртене.
          <br />
          За двете работни повърхности на всяка плоча има отделна глава
          (универсална, или по-често блок от четяща, изтриваща и записваща).
          Блокът магнитни глави се задвижва чрез рамо, извършвайки операцията
          позициониране на главите чрез радиално преместване.
          <br /> В устройствата със сменяеми дискови пакети главите типично
          позиционират по права линия (радиално; към центъра на шпиндела на
          пакета), задвижвани от линеен двигател. В повечето от съвременните
          запаметяващи устройства с твърд магнитен диск рамото се върти около
          ос, разположена извън пакета и успоредна на оста му, при което върхът
          на рамото и главите, закрепени на него, извършват движение по дъга от
          окръжност, ориентирана приблизително по радиуса на дисковия пакет.
          Записът става чрез промяна на ориентацията на отделните магнитни
          домени.
          <br />
          До края на 20 век записът се извършва надлъжно - ориентацията на
          домените е по протежение на пътечките, срещу или по посоката на
          въртене. Нуждата от повишаване на плътността на запис довежда до
          напречен запис - с ориентация на домените наляво или надясно, напречно
          на дължината на пистата, както и до перпендикулярен запис -
          перпендикулярно на повърхността, в дълбочината на магнитния слой, с
          ориентация на домените нагоре или надолу. <br />
          От гледна точка на оптимизацията на достъпа до данните върху пакета
          във физическата им организация е въведено понятието цилиндър,
          обединяващо мислено пистите с еднакъв диаметър от всички работни
          повърхности. Цилиндрите съответстват по брой и номерация на пистите по
          коя да е повърхност. При само една работна повърхност (но не плоча,
          т.к. плочата често използва глава за всяка от двете си работни
          повърхности) понятието цилиндър няма смисъл. <br />
          Поцилиндровите операции от тип търсене, четене или запис на информация
          често водят до съществена икономия във времето на достъп, доколкото в
          рамките на цилиндъра пистите се избират (сменят) чрез много бърза,
          електронна комутация на работната глава, а не се налага бавното
          препозициониране на друг номер писта (с друг радиус).
          <br />
          <tab />
          На 14 септември 1956 IBM представя два прототипа на бъдещия твърд
          диск, които носят името the RAMAC (random access memory for accounting
          and control) 305 и RAMAC 350. Техните размери са по 1 тон, с големина
          на хладилник и имат възможност да съхраняват 5 мегабайта информация.
        </p>
      </div>
      <div className="img">
        <img
          style={{ width: '50%' }}
          src="https://cdn.britannica.com/63/74063-050-2714FB88/hard-drive.jpg"
        ></img>
      </div>
    </div>
  );
}

export default HDD;
